pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22.h
/* HSADC - Register accessors */
#define HSADC_CTRL1_REG(base)                    ((base)->CTRL1)
#define HSADC_CTRL2_REG(base)                    ((base)->CTRL2)
#define HSADC_ZXCTRL1_REG(base)                  ((base)->ZXCTRL1)
#define HSADC_ZXCTRL2_REG(base)                  ((base)->ZXCTRL2)
#define HSADC_CLIST1_REG(base)                   ((base)->CLIST1)
#define HSADC_CLIST2_REG(base)                   ((base)->CLIST2)
#define HSADC_CLIST3_REG(base)                   ((base)->CLIST3)
#define HSADC_CLIST4_REG(base)                   ((base)->CLIST4)
#define HSADC_SDIS_REG(base)                     ((base)->SDIS)
#define HSADC_STAT_REG(base)                     ((base)->STAT)
#define HSADC_RDY_REG(base)                      ((base)->RDY)
#define HSADC_LOLIMSTAT_REG(base)                ((base)->LOLIMSTAT)
#define HSADC_HILIMSTAT_REG(base)                ((base)->HILIMSTAT)
#define HSADC_ZXSTAT_REG(base)                   ((base)->ZXSTAT)
#define HSADC_RSLT_REG(base,index)               ((base)->RSLT[index])
#define HSADC_RSLT_COUNT                         16
#define HSADC_LOLIM_REG(base,index)              ((base)->LOLIM[index])
#define HSADC_LOLIM_COUNT                        16
#define HSADC_HILIM_REG(base,index)              ((base)->HILIM[index])
#define HSADC_HILIM_COUNT                        16
#define HSADC_OFFST_REG(base,index)              ((base)->OFFST[index])
#define HSADC_OFFST_COUNT                        16
#define HSADC_PWR_REG(base)                      ((base)->PWR)
#define HSADC_SCTRL_REG(base)                    ((base)->SCTRL)
#define HSADC_PWR2_REG(base)                     ((base)->PWR2)
#define HSADC_CTRL3_REG(base)                    ((base)->CTRL3)
#define HSADC_SCHLTEN_REG(base)                  ((base)->SCHLTEN)
#define HSADC_SAMPTIM_REG(base)                  ((base)->SAMPTIM)
#define HSADC_CALIB_REG(base)                    ((base)->CALIB)
#define HSADC_CALVAL_A_REG(base)                 ((base)->CALVAL_A)
#define HSADC_CALVAL_B_REG(base)                 ((base)->CALVAL_B)
#define HSADC_MUX67_SEL_REG(base)                ((base)->MUX67_SEL)

/*!
 * @}
 */ /* end of group HSADC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- HSADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup HSADC_Register_Masks HSADC Register Masks
 * @{
 */

/* CTRL1 Bit Fields */
#define HSADC_CTRL1_SMODE_MASK                   0x7u
#define HSADC_CTRL1_SMODE_SHIFT                  0
#define HSADC_CTRL1_SMODE_WIDTH                  3
#define HSADC_CTRL1_SMODE(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_SMODE_SHIFT))&HSADC_CTRL1_SMODE_MASK)
#define HSADC_CTRL1_CHNCFG_L_MASK                0xF0u
#define HSADC_CTRL1_CHNCFG_L_SHIFT               4
#define HSADC_CTRL1_CHNCFG_L_WIDTH               4
#define HSADC_CTRL1_CHNCFG_L(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_CHNCFG_L_SHIFT))&HSADC_CTRL1_CHNCFG_L_MASK)
#define HSADC_CTRL1_HLMTIE_MASK                  0x100u
#define HSADC_CTRL1_HLMTIE_SHIFT                 8
#define HSADC_CTRL1_HLMTIE_WIDTH                 1
#define HSADC_CTRL1_HLMTIE(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_HLMTIE_SHIFT))&HSADC_CTRL1_HLMTIE_MASK)
#define HSADC_CTRL1_LLMTIE_MASK                  0x200u
#define HSADC_CTRL1_LLMTIE_SHIFT                 9
#define HSADC_CTRL1_LLMTIE_WIDTH                 1
#define HSADC_CTRL1_LLMTIE(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_LLMTIE_SHIFT))&HSADC_CTRL1_LLMTIE_MASK)
#define HSADC_CTRL1_ZCIE_MASK                    0x400u
#define HSADC_CTRL1_ZCIE_SHIFT                   10
#define HSADC_CTRL1_ZCIE_WIDTH                   1
#define HSADC_CTRL1_ZCIE(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_ZCIE_SHIFT))&HSADC_CTRL1_ZCIE_MASK)
#define HSADC_CTRL1_EOSIE0_MASK                  0x800u
#define HSADC_CTRL1_EOSIE0_SHIFT                 11
#define HSADC_CTRL1_EOSIE0_WIDTH                 1
#define HSADC_CTRL1_EOSIE0(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_EOSIE0_SHIFT))&HSADC_CTRL1_EOSIE0_MASK)
#define HSADC_CTRL1_SYNC0_MASK                   0x1000u
#define HSADC_CTRL1_SYNC0_SHIFT                  12
#define HSADC_CTRL1_SYNC0_WIDTH                  1
#define HSADC_CTRL1_SYNC0(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_SYNC0_SHIFT))&HSADC_CTRL1_SYNC0_MASK)
#define HSADC_CTRL1_START0_MASK                  0x2000u
#define HSADC_CTRL1_START0_SHIFT                 13
#define HSADC_CTRL1_START0_WIDTH                 1
#define HSADC_CTRL1_START0(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_START0_SHIFT))&HSADC_CTRL1_START0_MASK)
#define HSADC_CTRL1_STOP0_MASK                   0x4000u
#define HSADC_CTRL1_STOP0_SHIFT                  14
#define HSADC_CTRL1_STOP0_WIDTH                  1
#define HSADC_CTRL1_STOP0(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_STOP0_SHIFT))&HSADC_CTRL1_STOP0_MASK)
#define HSADC_CTRL1_DMAEN0_MASK                  0x8000u
#define HSADC_CTRL1_DMAEN0_SHIFT                 15
#define HSADC_CTRL1_DMAEN0_WIDTH                 1
#define HSADC_CTRL1_DMAEN0(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL1_DMAEN0_SHIFT))&HSADC_CTRL1_DMAEN0_MASK)
/* CTRL2 Bit Fields */
#define HSADC_CTRL2_DIV0_MASK                    0x3Fu
#define HSADC_CTRL2_DIV0_SHIFT                   0
#define HSADC_CTRL2_DIV0_WIDTH                   6
#define HSADC_CTRL2_DIV0(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_DIV0_SHIFT))&HSADC_CTRL2_DIV0_MASK)
#define HSADC_CTRL2_SIMULT_MASK                  0x40u
#define HSADC_CTRL2_SIMULT_SHIFT                 6
#define HSADC_CTRL2_SIMULT_WIDTH                 1
#define HSADC_CTRL2_SIMULT(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_SIMULT_SHIFT))&HSADC_CTRL2_SIMULT_MASK)
#define HSADC_CTRL2_CHNCFG_H_MASK                0x780u
#define HSADC_CTRL2_CHNCFG_H_SHIFT               7
#define HSADC_CTRL2_CHNCFG_H_WIDTH               4
#define HSADC_CTRL2_CHNCFG_H(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_CHNCFG_H_SHIFT))&HSADC_CTRL2_CHNCFG_H_MASK)
#define HSADC_CTRL2_EOSIE1_MASK                  0x800u
#define HSADC_CTRL2_EOSIE1_SHIFT                 11
#define HSADC_CTRL2_EOSIE1_WIDTH                 1
#define HSADC_CTRL2_EOSIE1(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_EOSIE1_SHIFT))&HSADC_CTRL2_EOSIE1_MASK)
#define HSADC_CTRL2_SYNC1_MASK                   0x1000u
#define HSADC_CTRL2_SYNC1_SHIFT                  12
#define HSADC_CTRL2_SYNC1_WIDTH                  1
#define HSADC_CTRL2_SYNC1(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_SYNC1_SHIFT))&HSADC_CTRL2_SYNC1_MASK)
#define HSADC_CTRL2_START1_MASK                  0x2000u
#define HSADC_CTRL2_START1_SHIFT                 13
#define HSADC_CTRL2_START1_WIDTH                 1
#define HSADC_CTRL2_START1(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_START1_SHIFT))&HSADC_CTRL2_START1_MASK)
#define HSADC_CTRL2_STOP1_MASK                   0x4000u
#define HSADC_CTRL2_STOP1_SHIFT                  14
#define HSADC_CTRL2_STOP1_WIDTH                  1
#define HSADC_CTRL2_STOP1(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_STOP1_SHIFT))&HSADC_CTRL2_STOP1_MASK)
#define HSADC_CTRL2_DMAEN1_MASK                  0x8000u
#define HSADC_CTRL2_DMAEN1_SHIFT                 15
#define HSADC_CTRL2_DMAEN1_WIDTH                 1
#define HSADC_CTRL2_DMAEN1(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL2_DMAEN1_SHIFT))&HSADC_CTRL2_DMAEN1_MASK)
/* ZXCTRL1 Bit Fields */
#define HSADC_ZXCTRL1_ZCE0_MASK                  0x3u
#define HSADC_ZXCTRL1_ZCE0_SHIFT                 0
#define HSADC_ZXCTRL1_ZCE0_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE0(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE0_SHIFT))&HSADC_ZXCTRL1_ZCE0_MASK)
#define HSADC_ZXCTRL1_ZCE1_MASK                  0xCu
#define HSADC_ZXCTRL1_ZCE1_SHIFT                 2
#define HSADC_ZXCTRL1_ZCE1_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE1(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE1_SHIFT))&HSADC_ZXCTRL1_ZCE1_MASK)
#define HSADC_ZXCTRL1_ZCE2_MASK                  0x30u
#define HSADC_ZXCTRL1_ZCE2_SHIFT                 4
#define HSADC_ZXCTRL1_ZCE2_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE2(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE2_SHIFT))&HSADC_ZXCTRL1_ZCE2_MASK)
#define HSADC_ZXCTRL1_ZCE3_MASK                  0xC0u
#define HSADC_ZXCTRL1_ZCE3_SHIFT                 6
#define HSADC_ZXCTRL1_ZCE3_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE3(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE3_SHIFT))&HSADC_ZXCTRL1_ZCE3_MASK)
#define HSADC_ZXCTRL1_ZCE4_MASK                  0x300u
#define HSADC_ZXCTRL1_ZCE4_SHIFT                 8
#define HSADC_ZXCTRL1_ZCE4_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE4(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE4_SHIFT))&HSADC_ZXCTRL1_ZCE4_MASK)
#define HSADC_ZXCTRL1_ZCE5_MASK                  0xC00u
#define HSADC_ZXCTRL1_ZCE5_SHIFT                 10
#define HSADC_ZXCTRL1_ZCE5_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE5(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE5_SHIFT))&HSADC_ZXCTRL1_ZCE5_MASK)
#define HSADC_ZXCTRL1_ZCE6_MASK                  0x3000u
#define HSADC_ZXCTRL1_ZCE6_SHIFT                 12
#define HSADC_ZXCTRL1_ZCE6_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE6(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE6_SHIFT))&HSADC_ZXCTRL1_ZCE6_MASK)
#define HSADC_ZXCTRL1_ZCE7_MASK                  0xC000u
#define HSADC_ZXCTRL1_ZCE7_SHIFT                 14
#define HSADC_ZXCTRL1_ZCE7_WIDTH                 2
#define HSADC_ZXCTRL1_ZCE7(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL1_ZCE7_SHIFT))&HSADC_ZXCTRL1_ZCE7_MASK)
/* ZXCTRL2 Bit Fields */
#define HSADC_ZXCTRL2_ZCE8_MASK                  0x3u
#define HSADC_ZXCTRL2_ZCE8_SHIFT                 0
#define HSADC_ZXCTRL2_ZCE8_WIDTH                 2
#define HSADC_ZXCTRL2_ZCE8(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE8_SHIFT))&HSADC_ZXCTRL2_ZCE8_MASK)
#define HSADC_ZXCTRL2_ZCE9_MASK                  0xCu
#define HSADC_ZXCTRL2_ZCE9_SHIFT                 2
#define HSADC_ZXCTRL2_ZCE9_WIDTH                 2
#define HSADC_ZXCTRL2_ZCE9(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE9_SHIFT))&HSADC_ZXCTRL2_ZCE9_MASK)
#define HSADC_ZXCTRL2_ZCE10_MASK                 0x30u
#define HSADC_ZXCTRL2_ZCE10_SHIFT                4
#define HSADC_ZXCTRL2_ZCE10_WIDTH                2
#define HSADC_ZXCTRL2_ZCE10(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE10_SHIFT))&HSADC_ZXCTRL2_ZCE10_MASK)
#define HSADC_ZXCTRL2_ZCE11_MASK                 0xC0u
#define HSADC_ZXCTRL2_ZCE11_SHIFT                6
#define HSADC_ZXCTRL2_ZCE11_WIDTH                2
#define HSADC_ZXCTRL2_ZCE11(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE11_SHIFT))&HSADC_ZXCTRL2_ZCE11_MASK)
#define HSADC_ZXCTRL2_ZCE12_MASK                 0x300u
#define HSADC_ZXCTRL2_ZCE12_SHIFT                8
#define HSADC_ZXCTRL2_ZCE12_WIDTH                2
#define HSADC_ZXCTRL2_ZCE12(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE12_SHIFT))&HSADC_ZXCTRL2_ZCE12_MASK)
#define HSADC_ZXCTRL2_ZCE13_MASK                 0xC00u
#define HSADC_ZXCTRL2_ZCE13_SHIFT                10
#define HSADC_ZXCTRL2_ZCE13_WIDTH                2
#define HSADC_ZXCTRL2_ZCE13(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE13_SHIFT))&HSADC_ZXCTRL2_ZCE13_MASK)
#define HSADC_ZXCTRL2_ZCE14_MASK                 0x3000u
#define HSADC_ZXCTRL2_ZCE14_SHIFT                12
#define HSADC_ZXCTRL2_ZCE14_WIDTH                2
#define HSADC_ZXCTRL2_ZCE14(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE14_SHIFT))&HSADC_ZXCTRL2_ZCE14_MASK)
#define HSADC_ZXCTRL2_ZCE15_MASK                 0xC000u
#define HSADC_ZXCTRL2_ZCE15_SHIFT                14
#define HSADC_ZXCTRL2_ZCE15_WIDTH                2
#define HSADC_ZXCTRL2_ZCE15(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_ZXCTRL2_ZCE15_SHIFT))&HSADC_ZXCTRL2_ZCE15_MASK)
/* CLIST1 Bit Fields */
#define HSADC_CLIST1_SAMPLE0_MASK                0xFu
#define HSADC_CLIST1_SAMPLE0_SHIFT               0
#define HSADC_CLIST1_SAMPLE0_WIDTH               4
#define HSADC_CLIST1_SAMPLE0(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST1_SAMPLE0_SHIFT))&HSADC_CLIST1_SAMPLE0_MASK)
#define HSADC_CLIST1_SAMPLE1_MASK                0xF0u
#define HSADC_CLIST1_SAMPLE1_SHIFT               4
#define HSADC_CLIST1_SAMPLE1_WIDTH               4
#define HSADC_CLIST1_SAMPLE1(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST1_SAMPLE1_SHIFT))&HSADC_CLIST1_SAMPLE1_MASK)
#define HSADC_CLIST1_SAMPLE2_MASK                0xF00u
#define HSADC_CLIST1_SAMPLE2_SHIFT               8
#define HSADC_CLIST1_SAMPLE2_WIDTH               4
#define HSADC_CLIST1_SAMPLE2(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST1_SAMPLE2_SHIFT))&HSADC_CLIST1_SAMPLE2_MASK)
#define HSADC_CLIST1_SAMPLE3_MASK                0xF000u
#define HSADC_CLIST1_SAMPLE3_SHIFT               12
#define HSADC_CLIST1_SAMPLE3_WIDTH               4
#define HSADC_CLIST1_SAMPLE3(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST1_SAMPLE3_SHIFT))&HSADC_CLIST1_SAMPLE3_MASK)
/* CLIST2 Bit Fields */
#define HSADC_CLIST2_SAMPLE4_MASK                0xFu
#define HSADC_CLIST2_SAMPLE4_SHIFT               0
#define HSADC_CLIST2_SAMPLE4_WIDTH               4
#define HSADC_CLIST2_SAMPLE4(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST2_SAMPLE4_SHIFT))&HSADC_CLIST2_SAMPLE4_MASK)
#define HSADC_CLIST2_SAMPLE5_MASK                0xF0u
#define HSADC_CLIST2_SAMPLE5_SHIFT               4
#define HSADC_CLIST2_SAMPLE5_WIDTH               4
#define HSADC_CLIST2_SAMPLE5(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST2_SAMPLE5_SHIFT))&HSADC_CLIST2_SAMPLE5_MASK)
#define HSADC_CLIST2_SAMPLE6_MASK                0xF00u
#define HSADC_CLIST2_SAMPLE6_SHIFT               8
#define HSADC_CLIST2_SAMPLE6_WIDTH               4
#define HSADC_CLIST2_SAMPLE6(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST2_SAMPLE6_SHIFT))&HSADC_CLIST2_SAMPLE6_MASK)
#define HSADC_CLIST2_SAMPLE7_MASK                0xF000u
#define HSADC_CLIST2_SAMPLE7_SHIFT               12
#define HSADC_CLIST2_SAMPLE7_WIDTH               4
#define HSADC_CLIST2_SAMPLE7(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST2_SAMPLE7_SHIFT))&HSADC_CLIST2_SAMPLE7_MASK)
/* CLIST3 Bit Fields */
#define HSADC_CLIST3_SAMPLE8_MASK                0xFu
#define HSADC_CLIST3_SAMPLE8_SHIFT               0
#define HSADC_CLIST3_SAMPLE8_WIDTH               4
#define HSADC_CLIST3_SAMPLE8(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST3_SAMPLE8_SHIFT))&HSADC_CLIST3_SAMPLE8_MASK)
#define HSADC_CLIST3_SAMPLE9_MASK                0xF0u
#define HSADC_CLIST3_SAMPLE9_SHIFT               4
#define HSADC_CLIST3_SAMPLE9_WIDTH               4
#define HSADC_CLIST3_SAMPLE9(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST3_SAMPLE9_SHIFT))&HSADC_CLIST3_SAMPLE9_MASK)
#define HSADC_CLIST3_SAMPLE10_MASK               0xF00u
#define HSADC_CLIST3_SAMPLE10_SHIFT              8
#define HSADC_CLIST3_SAMPLE10_WIDTH              4
#define HSADC_CLIST3_SAMPLE10(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST3_SAMPLE10_SHIFT))&HSADC_CLIST3_SAMPLE10_MASK)
#define HSADC_CLIST3_SAMPLE11_MASK               0xF000u
#define HSADC_CLIST3_SAMPLE11_SHIFT              12
#define HSADC_CLIST3_SAMPLE11_WIDTH              4
#define HSADC_CLIST3_SAMPLE11(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST3_SAMPLE11_SHIFT))&HSADC_CLIST3_SAMPLE11_MASK)
/* CLIST4 Bit Fields */
#define HSADC_CLIST4_SAMPLE12_MASK               0xFu
#define HSADC_CLIST4_SAMPLE12_SHIFT              0
#define HSADC_CLIST4_SAMPLE12_WIDTH              4
#define HSADC_CLIST4_SAMPLE12(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST4_SAMPLE12_SHIFT))&HSADC_CLIST4_SAMPLE12_MASK)
#define HSADC_CLIST4_SAMPLE13_MASK               0xF0u
#define HSADC_CLIST4_SAMPLE13_SHIFT              4
#define HSADC_CLIST4_SAMPLE13_WIDTH              4
#define HSADC_CLIST4_SAMPLE13(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST4_SAMPLE13_SHIFT))&HSADC_CLIST4_SAMPLE13_MASK)
#define HSADC_CLIST4_SAMPLE14_MASK               0xF00u
#define HSADC_CLIST4_SAMPLE14_SHIFT              8
#define HSADC_CLIST4_SAMPLE14_WIDTH              4
#define HSADC_CLIST4_SAMPLE14(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST4_SAMPLE14_SHIFT))&HSADC_CLIST4_SAMPLE14_MASK)
#define HSADC_CLIST4_SAMPLE15_MASK               0xF000u
#define HSADC_CLIST4_SAMPLE15_SHIFT              12
#define HSADC_CLIST4_SAMPLE15_WIDTH              4
#define HSADC_CLIST4_SAMPLE15(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_CLIST4_SAMPLE15_SHIFT))&HSADC_CLIST4_SAMPLE15_MASK)
/* SDIS Bit Fields */
#define HSADC_SDIS_DS_MASK                       0xFFFFu
#define HSADC_SDIS_DS_SHIFT                      0
#define HSADC_SDIS_DS_WIDTH                      16
#define HSADC_SDIS_DS(x)                         (((uint16_t)(((uint16_t)(x))<<HSADC_SDIS_DS_SHIFT))&HSADC_SDIS_DS_MASK)
/* STAT Bit Fields */
#define HSADC_STAT_CALON0_MASK                   0x1u
#define HSADC_STAT_CALON0_SHIFT                  0
#define HSADC_STAT_CALON0_WIDTH                  1
#define HSADC_STAT_CALON0(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_CALON0_SHIFT))&HSADC_STAT_CALON0_MASK)
#define HSADC_STAT_CALON1_MASK                   0x2u
#define HSADC_STAT_CALON1_SHIFT                  1
#define HSADC_STAT_CALON1_WIDTH                  1
#define HSADC_STAT_CALON1(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_CALON1_SHIFT))&HSADC_STAT_CALON1_MASK)
#define HSADC_STAT_DUMMY0_MASK                   0x4u
#define HSADC_STAT_DUMMY0_SHIFT                  2
#define HSADC_STAT_DUMMY0_WIDTH                  1
#define HSADC_STAT_DUMMY0(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_DUMMY0_SHIFT))&HSADC_STAT_DUMMY0_MASK)
#define HSADC_STAT_DUMMY1_MASK                   0x8u
#define HSADC_STAT_DUMMY1_SHIFT                  3
#define HSADC_STAT_DUMMY1_WIDTH                  1
#define HSADC_STAT_DUMMY1(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_DUMMY1_SHIFT))&HSADC_STAT_DUMMY1_MASK)
#define HSADC_STAT_EOCALI0_MASK                  0x10u
#define HSADC_STAT_EOCALI0_SHIFT                 4
#define HSADC_STAT_EOCALI0_WIDTH                 1
#define HSADC_STAT_EOCALI0(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_EOCALI0_SHIFT))&HSADC_STAT_EOCALI0_MASK)
#define HSADC_STAT_EOCALI1_MASK                  0x20u
#define HSADC_STAT_EOCALI1_SHIFT                 5
#define HSADC_STAT_EOCALI1_WIDTH                 1
#define HSADC_STAT_EOCALI1(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_EOCALI1_SHIFT))&HSADC_STAT_EOCALI1_MASK)
#define HSADC_STAT_HLMTI_MASK                    0x100u
#define HSADC_STAT_HLMTI_SHIFT                   8
#define HSADC_STAT_HLMTI_WIDTH                   1
#define HSADC_STAT_HLMTI(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_HLMTI_SHIFT))&HSADC_STAT_HLMTI_MASK)
#define HSADC_STAT_LLMTI_MASK                    0x200u
#define HSADC_STAT_LLMTI_SHIFT                   9
#define HSADC_STAT_LLMTI_WIDTH                   1
#define HSADC_STAT_LLMTI(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_LLMTI_SHIFT))&HSADC_STAT_LLMTI_MASK)
#define HSADC_STAT_ZCI_MASK                      0x400u
#define HSADC_STAT_ZCI_SHIFT                     10
#define HSADC_STAT_ZCI_WIDTH                     1
#define HSADC_STAT_ZCI(x)                        (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_ZCI_SHIFT))&HSADC_STAT_ZCI_MASK)
#define HSADC_STAT_EOSI0_MASK                    0x800u
#define HSADC_STAT_EOSI0_SHIFT                   11
#define HSADC_STAT_EOSI0_WIDTH                   1
#define HSADC_STAT_EOSI0(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_EOSI0_SHIFT))&HSADC_STAT_EOSI0_MASK)
#define HSADC_STAT_EOSI1_MASK                    0x1000u
#define HSADC_STAT_EOSI1_SHIFT                   12
#define HSADC_STAT_EOSI1_WIDTH                   1
#define HSADC_STAT_EOSI1(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_EOSI1_SHIFT))&HSADC_STAT_EOSI1_MASK)
#define HSADC_STAT_CIP1_MASK                     0x4000u
#define HSADC_STAT_CIP1_SHIFT                    14
#define HSADC_STAT_CIP1_WIDTH                    1
#define HSADC_STAT_CIP1(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_CIP1_SHIFT))&HSADC_STAT_CIP1_MASK)
#define HSADC_STAT_CIP0_MASK                     0x8000u
#define HSADC_STAT_CIP0_SHIFT                    15
#define HSADC_STAT_CIP0_WIDTH                    1
#define HSADC_STAT_CIP0(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_STAT_CIP0_SHIFT))&HSADC_STAT_CIP0_MASK)
/* RDY Bit Fields */
#define HSADC_RDY_RDY_MASK                       0xFFFFu
#define HSADC_RDY_RDY_SHIFT                      0
#define HSADC_RDY_RDY_WIDTH                      16
#define HSADC_RDY_RDY(x)                         (((uint16_t)(((uint16_t)(x))<<HSADC_RDY_RDY_SHIFT))&HSADC_RDY_RDY_MASK)
/* LOLIMSTAT Bit Fields */
#define HSADC_LOLIMSTAT_LLS_MASK                 0xFFFFu
#define HSADC_LOLIMSTAT_LLS_SHIFT                0
#define HSADC_LOLIMSTAT_LLS_WIDTH                16
#define HSADC_LOLIMSTAT_LLS(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_LOLIMSTAT_LLS_SHIFT))&HSADC_LOLIMSTAT_LLS_MASK)
/* HILIMSTAT Bit Fields */
#define HSADC_HILIMSTAT_HLS_MASK                 0xFFFFu
#define HSADC_HILIMSTAT_HLS_SHIFT                0
#define HSADC_HILIMSTAT_HLS_WIDTH                16
#define HSADC_HILIMSTAT_HLS(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_HILIMSTAT_HLS_SHIFT))&HSADC_HILIMSTAT_HLS_MASK)
/* ZXSTAT Bit Fields */
#define HSADC_ZXSTAT_ZCS_MASK                    0xFFFFu
#define HSADC_ZXSTAT_ZCS_SHIFT                   0
#define HSADC_ZXSTAT_ZCS_WIDTH                   16
#define HSADC_ZXSTAT_ZCS(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_ZXSTAT_ZCS_SHIFT))&HSADC_ZXSTAT_ZCS_MASK)
/* RSLT Bit Fields */
#define HSADC_RSLT_RSLT_MASK                     0x7FF8u
#define HSADC_RSLT_RSLT_SHIFT                    3
#define HSADC_RSLT_RSLT_WIDTH                    12
#define HSADC_RSLT_RSLT(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_RSLT_RSLT_SHIFT))&HSADC_RSLT_RSLT_MASK)
#define HSADC_RSLT_SEXT_MASK                     0x8000u
#define HSADC_RSLT_SEXT_SHIFT                    15
#define HSADC_RSLT_SEXT_WIDTH                    1
#define HSADC_RSLT_SEXT(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_RSLT_SEXT_SHIFT))&HSADC_RSLT_SEXT_MASK)
/* LOLIM Bit Fields */
#define HSADC_LOLIM_LLMT_MASK                    0x7FF8u
#define HSADC_LOLIM_LLMT_SHIFT                   3
#define HSADC_LOLIM_LLMT_WIDTH                   12
#define HSADC_LOLIM_LLMT(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_LOLIM_LLMT_SHIFT))&HSADC_LOLIM_LLMT_MASK)
/* HILIM Bit Fields */
#define HSADC_HILIM_HLMT_MASK                    0x7FF8u
#define HSADC_HILIM_HLMT_SHIFT                   3
#define HSADC_HILIM_HLMT_WIDTH                   12
#define HSADC_HILIM_HLMT(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_HILIM_HLMT_SHIFT))&HSADC_HILIM_HLMT_MASK)
/* OFFST Bit Fields */
#define HSADC_OFFST_OFFSET_MASK                  0x7FF8u
#define HSADC_OFFST_OFFSET_SHIFT                 3
#define HSADC_OFFST_OFFSET_WIDTH                 12
#define HSADC_OFFST_OFFSET(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_OFFST_OFFSET_SHIFT))&HSADC_OFFST_OFFSET_MASK)
