pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22.h
/* PCT Bit Fields */
#define MCM_PCT_PLREV_MASK                       0xFFFFu
#define MCM_PCT_PLREV_SHIFT                      0
#define MCM_PCT_PLREV_WIDTH                      16
#define MCM_PCT_PLREV(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_PCT_PLREV_SHIFT))&MCM_PCT_PLREV_MASK)
#define MCM_PCT_PCT_MASK                         0xFFFF0000u
#define MCM_PCT_PCT_SHIFT                        16
#define MCM_PCT_PCT_WIDTH                        16
#define MCM_PCT_PCT(x)                           (((uint32_t)(((uint32_t)(x))<<MCM_PCT_PCT_SHIFT))&MCM_PCT_PCT_MASK)
/* CR Bit Fields */
#define MCM_CR_AHBSPRI_MASK                      0x8000000u
#define MCM_CR_AHBSPRI_SHIFT                     27
#define MCM_CR_AHBSPRI_WIDTH                     1
#define MCM_CR_AHBSPRI(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CR_AHBSPRI_SHIFT))&MCM_CR_AHBSPRI_MASK)
/* ISCR Bit Fields */
#define MCM_ISCR_WABORTS_MASK                    0x20u
#define MCM_ISCR_WABORTS_SHIFT                   5
#define MCM_ISCR_WABORTS_WIDTH                   1
#define MCM_ISCR_WABORTS(x)                      (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_WABORTS_SHIFT))&MCM_ISCR_WABORTS_MASK)
#define MCM_ISCR_WABORTS_OVERRUN_MASK            0x40u
#define MCM_ISCR_WABORTS_OVERRUN_SHIFT           6
#define MCM_ISCR_WABORTS_OVERRUN_WIDTH           1
#define MCM_ISCR_WABORTS_OVERRUN(x)              (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_WABORTS_OVERRUN_SHIFT))&MCM_ISCR_WABORTS_OVERRUN_MASK)
#define MCM_ISCR_FIOC_MASK                       0x100u
#define MCM_ISCR_FIOC_SHIFT                      8
#define MCM_ISCR_FIOC_WIDTH                      1
#define MCM_ISCR_FIOC(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FIOC_SHIFT))&MCM_ISCR_FIOC_MASK)
#define MCM_ISCR_FDZC_MASK                       0x200u
#define MCM_ISCR_FDZC_SHIFT                      9
#define MCM_ISCR_FDZC_WIDTH                      1
#define MCM_ISCR_FDZC(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FDZC_SHIFT))&MCM_ISCR_FDZC_MASK)
#define MCM_ISCR_FOFC_MASK                       0x400u
#define MCM_ISCR_FOFC_SHIFT                      10
#define MCM_ISCR_FOFC_WIDTH                      1
#define MCM_ISCR_FOFC(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FOFC_SHIFT))&MCM_ISCR_FOFC_MASK)
#define MCM_ISCR_FUFC_MASK                       0x800u
#define MCM_ISCR_FUFC_SHIFT                      11
#define MCM_ISCR_FUFC_WIDTH                      1
#define MCM_ISCR_FUFC(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FUFC_SHIFT))&MCM_ISCR_FUFC_MASK)
#define MCM_ISCR_FIXC_MASK                       0x1000u
#define MCM_ISCR_FIXC_SHIFT                      12
#define MCM_ISCR_FIXC_WIDTH                      1
#define MCM_ISCR_FIXC(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FIXC_SHIFT))&MCM_ISCR_FIXC_MASK)
#define MCM_ISCR_FIDC_MASK                       0x8000u
#define MCM_ISCR_FIDC_SHIFT                      15
#define MCM_ISCR_FIDC_WIDTH                      1
#define MCM_ISCR_FIDC(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FIDC_SHIFT))&MCM_ISCR_FIDC_MASK)
#define MCM_ISCR_WABORTS_EN_MASK                 0x200000u
#define MCM_ISCR_WABORTS_EN_SHIFT                21
#define MCM_ISCR_WABORTS_EN_WIDTH                1
#define MCM_ISCR_WABORTS_EN(x)                   (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_WABORTS_EN_SHIFT))&MCM_ISCR_WABORTS_EN_MASK)
#define MCM_ISCR_FIOCE_MASK                      0x1000000u
#define MCM_ISCR_FIOCE_SHIFT                     24
#define MCM_ISCR_FIOCE_WIDTH                     1
#define MCM_ISCR_FIOCE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FIOCE_SHIFT))&MCM_ISCR_FIOCE_MASK)
#define MCM_ISCR_FDZCE_MASK                      0x2000000u
#define MCM_ISCR_FDZCE_SHIFT                     25
#define MCM_ISCR_FDZCE_WIDTH                     1
#define MCM_ISCR_FDZCE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FDZCE_SHIFT))&MCM_ISCR_FDZCE_MASK)
#define MCM_ISCR_FOFCE_MASK                      0x4000000u
#define MCM_ISCR_FOFCE_SHIFT                     26
#define MCM_ISCR_FOFCE_WIDTH                     1
#define MCM_ISCR_FOFCE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FOFCE_SHIFT))&MCM_ISCR_FOFCE_MASK)
#define MCM_ISCR_FUFCE_MASK                      0x8000000u
#define MCM_ISCR_FUFCE_SHIFT                     27
#define MCM_ISCR_FUFCE_WIDTH                     1
#define MCM_ISCR_FUFCE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FUFCE_SHIFT))&MCM_ISCR_FUFCE_MASK)
#define MCM_ISCR_FIXCE_MASK                      0x10000000u
#define MCM_ISCR_FIXCE_SHIFT                     28
#define MCM_ISCR_FIXCE_WIDTH                     1
#define MCM_ISCR_FIXCE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FIXCE_SHIFT))&MCM_ISCR_FIXCE_MASK)
#define MCM_ISCR_FIDCE_MASK                      0x80000000u
#define MCM_ISCR_FIDCE_SHIFT                     31
#define MCM_ISCR_FIDCE_WIDTH                     1
#define MCM_ISCR_FIDCE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ISCR_FIDCE_SHIFT))&MCM_ISCR_FIDCE_MASK)
/* CPO Bit Fields */
#define MCM_CPO_CPOREQ_MASK                      0x1u
#define MCM_CPO_CPOREQ_SHIFT                     0
#define MCM_CPO_CPOREQ_WIDTH                     1
#define MCM_CPO_CPOREQ(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CPO_CPOREQ_SHIFT))&MCM_CPO_CPOREQ_MASK)
#define MCM_CPO_CPOACK_MASK                      0x2u
#define MCM_CPO_CPOACK_SHIFT                     1
#define MCM_CPO_CPOACK_WIDTH                     1
#define MCM_CPO_CPOACK(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CPO_CPOACK_SHIFT))&MCM_CPO_CPOACK_MASK)
/* LMEM Bit Fields */
#define MCM_LMEM_LMEM_Type_MASK                  0xE000u
#define MCM_LMEM_LMEM_Type_SHIFT                 13
#define MCM_LMEM_LMEM_Type_WIDTH                 3
#define MCM_LMEM_LMEM_Type(x)                    (((uint32_t)(((uint32_t)(x))<<MCM_LMEM_LMEM_Type_SHIFT))&MCM_LMEM_LMEM_Type_MASK)
#define MCM_LMEM_LMEM_Width_MASK                 0xE0000u
#define MCM_LMEM_LMEM_Width_SHIFT                17
#define MCM_LMEM_LMEM_Width_WIDTH                3
#define MCM_LMEM_LMEM_Width(x)                   (((uint32_t)(((uint32_t)(x))<<MCM_LMEM_LMEM_Width_SHIFT))&MCM_LMEM_LMEM_Width_MASK)
#define MCM_LMEM_LMEM_Ways_MASK                  0xF00000u
#define MCM_LMEM_LMEM_Ways_SHIFT                 20
#define MCM_LMEM_LMEM_Ways_WIDTH                 4
#define MCM_LMEM_LMEM_Ways(x)                    (((uint32_t)(((uint32_t)(x))<<MCM_LMEM_LMEM_Ways_SHIFT))&MCM_LMEM_LMEM_Ways_MASK)
#define MCM_LMEM_LMEM_Size_MASK                  0xF000000u
#define MCM_LMEM_LMEM_Size_SHIFT                 24
#define MCM_LMEM_LMEM_Size_WIDTH                 4
#define MCM_LMEM_LMEM_Size(x)                    (((uint32_t)(((uint32_t)(x))<<MCM_LMEM_LMEM_Size_SHIFT))&MCM_LMEM_LMEM_Size_MASK)
#define MCM_LMEM_LMEM_Valid_MASK                 0x80000000u
#define MCM_LMEM_LMEM_Valid_SHIFT                31
#define MCM_LMEM_LMEM_Valid_WIDTH                1
#define MCM_LMEM_LMEM_Valid(x)                   (((uint32_t)(((uint32_t)(x))<<MCM_LMEM_LMEM_Valid_SHIFT))&MCM_LMEM_LMEM_Valid_MASK)

/*!
 * @}
 */ /* end of group MCM_Register_Masks */


/* MCM - Peripheral instance base addresses */
/** Peripheral MCM base address */
#define MCM_BASE                                 (0xE0080000u)
/** Peripheral MCM base pointer */
#define MCM                                      ((MCM_Type *)MCM_BASE)
#define MCM_BASE_PTR                             (MCM)
/** Array initializer of MCM peripheral base addresses */
#define MCM_BASE_ADDRS                           { MCM_BASE }
/** Array initializer of MCM peripheral base pointers */
#define MCM_BASE_PTRS                            { MCM }

/* ----------------------------------------------------------------------------
   -- MCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Register_Accessor_Macros MCM - Register accessor macros
 * @{
 */


/* MCM - Register instance definitions */
/* MCM */
#define MCM_PCT                                  MCM_PCT_REG(MCM)
#define MCM_CR                                   MCM_CR_REG(MCM)
#define MCM_ISCR                                 MCM_ISCR_REG(MCM)
#define MCM_CPO                                  MCM_CPO_REG(MCM)
#define MCM_LMEM0                                MCM_LMEM_REG(MCM,0)
#define MCM_LMEM1                                MCM_LMEM_REG(MCM,1)
#define MCM_LMEM2                                MCM_LMEM_REG(MCM,2)
#define MCM_LMEM3                                MCM_LMEM_REG(MCM,3)
#define MCM_LMEM4                                MCM_LMEM_REG(MCM,4)

/* MCM - Register array accessors */
#define MCM_LMEM(index)                          MCM_LMEM_REG(MCM,index)

/*!
 * @}
 */ /* end of group MCM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group MCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MPU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MPU_Peripheral_Access_Layer MPU Peripheral Access Layer
 * @{
 */

/** MPU - Register Layout Typedef */
typedef struct {
  __IO uint32_t CESR;                              /**< Control/Error Status Register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  struct {                                         /* offset: 0x10, array step: 0x8 */
    __I  uint32_t EAR;                               /**< Error Address Register, slave port n, array offset: 0x10, array step: 0x8 */
    __I  uint32_t EDR;                               /**< Error Detail Register, slave port n, array offset: 0x14, array step: 0x8 */
  } SP[5];
       uint8_t RESERVED_1[968];
  __IO uint32_t WORD[12][4];                       /**< Region Descriptor n, Word 0..Region Descriptor n, Word 3, array offset: 0x400, array step: index*0x10, index2*0x4 */
       uint8_t RESERVED_2[832];
  __IO uint32_t RGDAAC[12];                        /**< Region Descriptor Alternate Access Control n, array offset: 0x800, array step: 0x4 */
} MPU_Type, *MPU_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- MPU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MPU_Register_Accessor_Macros MPU - Register accessor macros
 * @{
 */


/* MPU - Register accessors */
#define MPU_CESR_REG(base)                       ((base)->CESR)
#define MPU_EAR_REG(base,index)                  ((base)->SP[index].EAR)
#define MPU_EAR_COUNT                            5
#define MPU_EDR_REG(base,index)                  ((base)->SP[index].EDR)
#define MPU_EDR_COUNT                            5
#define MPU_WORD_REG(base,index,index2)          ((base)->WORD[index][index2])
#define MPU_WORD_COUNT                           12
#define MPU_WORD_COUNT2                          4
#define MPU_RGDAAC_REG(base,index)               ((base)->RGDAAC[index])
#define MPU_RGDAAC_COUNT                         12

/*!
 * @}
 */ /* end of group MPU_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- MPU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MPU_Register_Masks MPU Register Masks
 * @{
 */

