pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22.h
#define PWM_FAULT_CTRL_FLVL(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_CTRL_FLVL_SHIFT))&PWM_FAULT_CTRL_FLVL_MASK)
/* FAULT_STS Bit Fields */
#define PWM_FAULT_STS_FFLAG_MASK                 0xFu
#define PWM_FAULT_STS_FFLAG_SHIFT                0
#define PWM_FAULT_STS_FFLAG_WIDTH                4
#define PWM_FAULT_STS_FFLAG(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_STS_FFLAG_SHIFT))&PWM_FAULT_STS_FFLAG_MASK)
#define PWM_FAULT_STS_FFULL_MASK                 0xF0u
#define PWM_FAULT_STS_FFULL_SHIFT                4
#define PWM_FAULT_STS_FFULL_WIDTH                4
#define PWM_FAULT_STS_FFULL(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_STS_FFULL_SHIFT))&PWM_FAULT_STS_FFULL_MASK)
#define PWM_FAULT_STS_FFPIN_MASK                 0xF00u
#define PWM_FAULT_STS_FFPIN_SHIFT                8
#define PWM_FAULT_STS_FFPIN_WIDTH                4
#define PWM_FAULT_STS_FFPIN(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_STS_FFPIN_SHIFT))&PWM_FAULT_STS_FFPIN_MASK)
#define PWM_FAULT_STS_FHALF_MASK                 0xF000u
#define PWM_FAULT_STS_FHALF_SHIFT                12
#define PWM_FAULT_STS_FHALF_WIDTH                4
#define PWM_FAULT_STS_FHALF(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_STS_FHALF_SHIFT))&PWM_FAULT_STS_FHALF_MASK)
/* FAULT_FILT Bit Fields */
#define PWM_FAULT_FILT_FILT_PER_MASK             0xFFu
#define PWM_FAULT_FILT_FILT_PER_SHIFT            0
#define PWM_FAULT_FILT_FILT_PER_WIDTH            8
#define PWM_FAULT_FILT_FILT_PER(x)               (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_FILT_FILT_PER_SHIFT))&PWM_FAULT_FILT_FILT_PER_MASK)
#define PWM_FAULT_FILT_FILT_CNT_MASK             0x700u
#define PWM_FAULT_FILT_FILT_CNT_SHIFT            8
#define PWM_FAULT_FILT_FILT_CNT_WIDTH            3
#define PWM_FAULT_FILT_FILT_CNT(x)               (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_FILT_FILT_CNT_SHIFT))&PWM_FAULT_FILT_FILT_CNT_MASK)
#define PWM_FAULT_FILT_GSTR_MASK                 0x8000u
#define PWM_FAULT_FILT_GSTR_SHIFT                15
#define PWM_FAULT_FILT_GSTR_WIDTH                1
#define PWM_FAULT_FILT_GSTR(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_FILT_GSTR_SHIFT))&PWM_FAULT_FILT_GSTR_MASK)
/* FAULT_TST Bit Fields */
#define PWM_FAULT_TST_FTEST_MASK                 0x1u
#define PWM_FAULT_TST_FTEST_SHIFT                0
#define PWM_FAULT_TST_FTEST_WIDTH                1
#define PWM_FAULT_TST_FTEST(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_TST_FTEST_SHIFT))&PWM_FAULT_TST_FTEST_MASK)
/* FAULT_CTRL2 Bit Fields */
#define PWM_FAULT_CTRL2_NOCOMB_MASK              0xFu
#define PWM_FAULT_CTRL2_NOCOMB_SHIFT             0
#define PWM_FAULT_CTRL2_NOCOMB_WIDTH             4
#define PWM_FAULT_CTRL2_NOCOMB(x)                (((uint16_t)(((uint16_t)(x))<<PWM_FAULT_CTRL2_NOCOMB_SHIFT))&PWM_FAULT_CTRL2_NOCOMB_MASK)

/*!
 * @}
 */ /* end of group PWM_Register_Masks */


/* PWM - Peripheral instance base addresses */
/** Peripheral PWMA base address */
#define PWMA_BASE                                (0x80066000u)
/** Peripheral PWMA base pointer */
#define PWMA                                     ((PWM_Type *)PWMA_BASE)
#define PWMA_BASE_PTR                            (PWMA)
/** Peripheral PWMB base address */
#define PWMB_BASE                                (0x80166000u)
/** Peripheral PWMB base pointer */
#define PWMB                                     ((PWM_Type *)PWMB_BASE)
#define PWMB_BASE_PTR                            (PWMB)
/** Array initializer of PWM peripheral base addresses */
#define PWM_BASE_ADDRS                           { PWMA_BASE, PWMB_BASE }
/** Array initializer of PWM peripheral base pointers */
#define PWM_BASE_PTRS                            { PWMA, PWMB }

/* ----------------------------------------------------------------------------
   -- PWM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWM_Register_Accessor_Macros PWM - Register accessor macros
 * @{
 */


/* PWM - Register instance definitions */
/* PWMA */
#define PWMA_SM0CNT                              PWM_CNT_REG(PWMA,0)
#define PWMA_SM0INIT                             PWM_INIT_REG(PWMA,0)
#define PWMA_SM0CTRL2                            PWM_CTRL2_REG(PWMA,0)
#define PWMA_SM0CTRL                             PWM_CTRL_REG(PWMA,0)
#define PWMA_SM0VAL0                             PWM_VAL0_REG(PWMA,0)
#define PWMA_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWMA,0)
#define PWMA_SM0VAL1                             PWM_VAL1_REG(PWMA,0)
#define PWMA_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWMA,0)
#define PWMA_SM0VAL2                             PWM_VAL2_REG(PWMA,0)
#define PWMA_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWMA,0)
#define PWMA_SM0VAL3                             PWM_VAL3_REG(PWMA,0)
#define PWMA_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWMA,0)
#define PWMA_SM0VAL4                             PWM_VAL4_REG(PWMA,0)
#define PWMA_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWMA,0)
#define PWMA_SM0VAL5                             PWM_VAL5_REG(PWMA,0)
#define PWMA_SM0FRCTRL                           PWM_FRCTRL_REG(PWMA,0)
#define PWMA_SM0OCTRL                            PWM_OCTRL_REG(PWMA,0)
#define PWMA_SM0STS                              PWM_STS_REG(PWMA,0)
#define PWMA_SM0INTEN                            PWM_INTEN_REG(PWMA,0)
#define PWMA_SM0DMAEN                            PWM_DMAEN_REG(PWMA,0)
#define PWMA_SM0TCTRL                            PWM_TCTRL_REG(PWMA,0)
#define PWMA_SM0DISMAP0                          PWM_DISMAP_REG(PWMA,0,0)
#define PWMA_SM0DTCNT0                           PWM_DTCNT0_REG(PWMA,0)
#define PWMA_SM0DTCNT1                           PWM_DTCNT1_REG(PWMA,0)
#define PWMA_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMA,0)
#define PWMA_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMA,0)
#define PWMA_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMA,0)
#define PWMA_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMA,0)
#define PWMA_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMA,0)
#define PWMA_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMA,0)
#define PWMA_SM0CVAL0                            PWM_CVAL0_REG(PWMA,0)
#define PWMA_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWMA,0)
#define PWMA_SM0CVAL1                            PWM_CVAL1_REG(PWMA,0)
#define PWMA_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWMA,0)
#define PWMA_SM0CVAL2                            PWM_CVAL2_REG(PWMA,0)
#define PWMA_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWMA,0)
#define PWMA_SM0CVAL3                            PWM_CVAL3_REG(PWMA,0)
#define PWMA_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWMA,0)
#define PWMA_SM0CVAL4                            PWM_CVAL4_REG(PWMA,0)
#define PWMA_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWMA,0)
#define PWMA_SM0CVAL5                            PWM_CVAL5_REG(PWMA,0)
#define PWMA_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWMA,0)
#define PWMA_SM1CNT                              PWM_CNT_REG(PWMA,1)
#define PWMA_SM1INIT                             PWM_INIT_REG(PWMA,1)
#define PWMA_SM1CTRL2                            PWM_CTRL2_REG(PWMA,1)
#define PWMA_SM1CTRL                             PWM_CTRL_REG(PWMA,1)
#define PWMA_SM1VAL0                             PWM_VAL0_REG(PWMA,1)
#define PWMA_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWMA,1)
#define PWMA_SM1VAL1                             PWM_VAL1_REG(PWMA,1)
#define PWMA_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWMA,1)
#define PWMA_SM1VAL2                             PWM_VAL2_REG(PWMA,1)
#define PWMA_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWMA,1)
#define PWMA_SM1VAL3                             PWM_VAL3_REG(PWMA,1)
#define PWMA_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWMA,1)
#define PWMA_SM1VAL4                             PWM_VAL4_REG(PWMA,1)
#define PWMA_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWMA,1)
#define PWMA_SM1VAL5                             PWM_VAL5_REG(PWMA,1)
#define PWMA_SM1FRCTRL                           PWM_FRCTRL_REG(PWMA,1)
#define PWMA_SM1OCTRL                            PWM_OCTRL_REG(PWMA,1)
#define PWMA_SM1STS                              PWM_STS_REG(PWMA,1)
#define PWMA_SM1INTEN                            PWM_INTEN_REG(PWMA,1)
#define PWMA_SM1DMAEN                            PWM_DMAEN_REG(PWMA,1)
#define PWMA_SM1TCTRL                            PWM_TCTRL_REG(PWMA,1)
#define PWMA_SM1DISMAP0                          PWM_DISMAP_REG(PWMA,1,0)
#define PWMA_SM1DTCNT0                           PWM_DTCNT0_REG(PWMA,1)
#define PWMA_SM1DTCNT1                           PWM_DTCNT1_REG(PWMA,1)
#define PWMA_SM1CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMA,1)
#define PWMA_SM1CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMA,1)
#define PWMA_SM1CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMA,1)
#define PWMA_SM1CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMA,1)
#define PWMA_SM1CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMA,1)
#define PWMA_SM1CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMA,1)
#define PWMA_SM1CVAL0                            PWM_CVAL0_REG(PWMA,1)
#define PWMA_SM1CVAL0CYC                         PWM_CVAL0CYC_REG(PWMA,1)
#define PWMA_SM1CVAL1                            PWM_CVAL1_REG(PWMA,1)
#define PWMA_SM1CVAL1CYC                         PWM_CVAL1CYC_REG(PWMA,1)
#define PWMA_SM1CVAL2                            PWM_CVAL2_REG(PWMA,1)
#define PWMA_SM1CVAL2CYC                         PWM_CVAL2CYC_REG(PWMA,1)
#define PWMA_SM1CVAL3                            PWM_CVAL3_REG(PWMA,1)
#define PWMA_SM1CVAL3CYC                         PWM_CVAL3CYC_REG(PWMA,1)
#define PWMA_SM1CVAL4                            PWM_CVAL4_REG(PWMA,1)
#define PWMA_SM1CVAL4CYC                         PWM_CVAL4CYC_REG(PWMA,1)
#define PWMA_SM1CVAL5                            PWM_CVAL5_REG(PWMA,1)
#define PWMA_SM1CVAL5CYC                         PWM_CVAL5CYC_REG(PWMA,1)
#define PWMA_SM2CNT                              PWM_CNT_REG(PWMA,2)
#define PWMA_SM2INIT                             PWM_INIT_REG(PWMA,2)
#define PWMA_SM2CTRL2                            PWM_CTRL2_REG(PWMA,2)
#define PWMA_SM2CTRL                             PWM_CTRL_REG(PWMA,2)
#define PWMA_SM2VAL0                             PWM_VAL0_REG(PWMA,2)
#define PWMA_SM2FRACVAL1                         PWM_FRACVAL1_REG(PWMA,2)
#define PWMA_SM2VAL1                             PWM_VAL1_REG(PWMA,2)
#define PWMA_SM2FRACVAL2                         PWM_FRACVAL2_REG(PWMA,2)
#define PWMA_SM2VAL2                             PWM_VAL2_REG(PWMA,2)
#define PWMA_SM2FRACVAL3                         PWM_FRACVAL3_REG(PWMA,2)
#define PWMA_SM2VAL3                             PWM_VAL3_REG(PWMA,2)
#define PWMA_SM2FRACVAL4                         PWM_FRACVAL4_REG(PWMA,2)
#define PWMA_SM2VAL4                             PWM_VAL4_REG(PWMA,2)
#define PWMA_SM2FRACVAL5                         PWM_FRACVAL5_REG(PWMA,2)
#define PWMA_SM2VAL5                             PWM_VAL5_REG(PWMA,2)
#define PWMA_SM2FRCTRL                           PWM_FRCTRL_REG(PWMA,2)
#define PWMA_SM2OCTRL                            PWM_OCTRL_REG(PWMA,2)
#define PWMA_SM2STS                              PWM_STS_REG(PWMA,2)
#define PWMA_SM2INTEN                            PWM_INTEN_REG(PWMA,2)
#define PWMA_SM2DMAEN                            PWM_DMAEN_REG(PWMA,2)
#define PWMA_SM2TCTRL                            PWM_TCTRL_REG(PWMA,2)
#define PWMA_SM2DISMAP0                          PWM_DISMAP_REG(PWMA,2,0)
#define PWMA_SM2DTCNT0                           PWM_DTCNT0_REG(PWMA,2)
#define PWMA_SM2DTCNT1                           PWM_DTCNT1_REG(PWMA,2)
#define PWMA_SM2CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMA,2)
#define PWMA_SM2CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMA,2)
#define PWMA_SM2CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMA,2)
#define PWMA_SM2CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMA,2)
#define PWMA_SM2CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMA,2)
#define PWMA_SM2CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMA,2)
#define PWMA_SM2CVAL0                            PWM_CVAL0_REG(PWMA,2)
#define PWMA_SM2CVAL0CYC                         PWM_CVAL0CYC_REG(PWMA,2)
#define PWMA_SM2CVAL1                            PWM_CVAL1_REG(PWMA,2)
#define PWMA_SM2CVAL1CYC                         PWM_CVAL1CYC_REG(PWMA,2)
#define PWMA_SM2CVAL2                            PWM_CVAL2_REG(PWMA,2)
#define PWMA_SM2CVAL2CYC                         PWM_CVAL2CYC_REG(PWMA,2)
#define PWMA_SM2CVAL3                            PWM_CVAL3_REG(PWMA,2)
#define PWMA_SM2CVAL3CYC                         PWM_CVAL3CYC_REG(PWMA,2)
#define PWMA_SM2CVAL4                            PWM_CVAL4_REG(PWMA,2)
#define PWMA_SM2CVAL4CYC                         PWM_CVAL4CYC_REG(PWMA,2)
#define PWMA_SM2CVAL5                            PWM_CVAL5_REG(PWMA,2)
#define PWMA_SM2CVAL5CYC                         PWM_CVAL5CYC_REG(PWMA,2)
#define PWMA_SM3CNT                              PWM_CNT_REG(PWMA,3)
#define PWMA_SM3INIT                             PWM_INIT_REG(PWMA,3)
#define PWMA_SM3CTRL2                            PWM_CTRL2_REG(PWMA,3)
#define PWMA_SM3CTRL                             PWM_CTRL_REG(PWMA,3)
#define PWMA_SM3VAL0                             PWM_VAL0_REG(PWMA,3)
#define PWMA_SM3FRACVAL1                         PWM_FRACVAL1_REG(PWMA,3)
#define PWMA_SM3VAL1                             PWM_VAL1_REG(PWMA,3)
#define PWMA_SM3FRACVAL2                         PWM_FRACVAL2_REG(PWMA,3)
#define PWMA_SM3VAL2                             PWM_VAL2_REG(PWMA,3)
#define PWMA_SM3FRACVAL3                         PWM_FRACVAL3_REG(PWMA,3)
#define PWMA_SM3VAL3                             PWM_VAL3_REG(PWMA,3)
#define PWMA_SM3FRACVAL4                         PWM_FRACVAL4_REG(PWMA,3)
#define PWMA_SM3VAL4                             PWM_VAL4_REG(PWMA,3)
#define PWMA_SM3FRACVAL5                         PWM_FRACVAL5_REG(PWMA,3)
#define PWMA_SM3VAL5                             PWM_VAL5_REG(PWMA,3)
#define PWMA_SM3FRCTRL                           PWM_FRCTRL_REG(PWMA,3)
#define PWMA_SM3OCTRL                            PWM_OCTRL_REG(PWMA,3)
#define PWMA_SM3STS                              PWM_STS_REG(PWMA,3)
#define PWMA_SM3INTEN                            PWM_INTEN_REG(PWMA,3)
#define PWMA_SM3DMAEN                            PWM_DMAEN_REG(PWMA,3)
#define PWMA_SM3TCTRL                            PWM_TCTRL_REG(PWMA,3)
#define PWMA_SM3DISMAP0                          PWM_DISMAP_REG(PWMA,3,0)
#define PWMA_SM3DTCNT0                           PWM_DTCNT0_REG(PWMA,3)
#define PWMA_SM3DTCNT1                           PWM_DTCNT1_REG(PWMA,3)
#define PWMA_SM3CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMA,3)
#define PWMA_SM3CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMA,3)
#define PWMA_SM3CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMA,3)
#define PWMA_SM3CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMA,3)
#define PWMA_SM3CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMA,3)
#define PWMA_SM3CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMA,3)
#define PWMA_SM3CVAL0                            PWM_CVAL0_REG(PWMA,3)
#define PWMA_SM3CVAL0CYC                         PWM_CVAL0CYC_REG(PWMA,3)
#define PWMA_SM3CVAL1                            PWM_CVAL1_REG(PWMA,3)
#define PWMA_SM3CVAL1CYC                         PWM_CVAL1CYC_REG(PWMA,3)
#define PWMA_SM3CVAL2                            PWM_CVAL2_REG(PWMA,3)
#define PWMA_SM3CVAL2CYC                         PWM_CVAL2CYC_REG(PWMA,3)
#define PWMA_SM3CVAL3                            PWM_CVAL3_REG(PWMA,3)
#define PWMA_SM3CVAL3CYC                         PWM_CVAL3CYC_REG(PWMA,3)
#define PWMA_SM3CVAL4                            PWM_CVAL4_REG(PWMA,3)
#define PWMA_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWMA,3)
#define PWMA_SM3CVAL5                            PWM_CVAL5_REG(PWMA,3)
#define PWMA_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWMA,3)
#define PWMA_OUTEN                               PWM_OUTEN_REG(PWMA)
#define PWMA_MASK                                PWM_MASK_REG(PWMA)
#define PWMA_SWCOUT                              PWM_SWCOUT_REG(PWMA)
#define PWMA_DTSRCSEL                            PWM_DTSRCSEL_REG(PWMA)
#define PWMA_MCTRL                               PWM_MCTRL_REG(PWMA)
#define PWMA_MCTRL2                              PWM_MCTRL2_REG(PWMA)
#define PWMA_FCTRL                               PWM_FAULT_CTRL_REG(PWMA,0)
#define PWMA_FSTS                                PWM_FAULT_STS_REG(PWMA,0)
#define PWMA_FFILT                               PWM_FAULT_FILT_REG(PWMA,0)
#define PWMA_FTST                                PWM_FAULT_TST_REG(PWMA,0)
#define PWMA_FCTRL2                              PWM_FAULT_CTRL2_REG(PWMA,0)
/* PWMB */
#define PWMB_SM0CNT                              PWM_CNT_REG(PWMB,0)
#define PWMB_SM0INIT                             PWM_INIT_REG(PWMB,0)
#define PWMB_SM0CTRL2                            PWM_CTRL2_REG(PWMB,0)
#define PWMB_SM0CTRL                             PWM_CTRL_REG(PWMB,0)
#define PWMB_SM0VAL0                             PWM_VAL0_REG(PWMB,0)
#define PWMB_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWMB,0)
#define PWMB_SM0VAL1                             PWM_VAL1_REG(PWMB,0)
#define PWMB_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWMB,0)
#define PWMB_SM0VAL2                             PWM_VAL2_REG(PWMB,0)
#define PWMB_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWMB,0)
#define PWMB_SM0VAL3                             PWM_VAL3_REG(PWMB,0)
#define PWMB_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWMB,0)
#define PWMB_SM0VAL4                             PWM_VAL4_REG(PWMB,0)
#define PWMB_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWMB,0)
#define PWMB_SM0VAL5                             PWM_VAL5_REG(PWMB,0)
#define PWMB_SM0FRCTRL                           PWM_FRCTRL_REG(PWMB,0)
#define PWMB_SM0OCTRL                            PWM_OCTRL_REG(PWMB,0)
#define PWMB_SM0STS                              PWM_STS_REG(PWMB,0)
#define PWMB_SM0INTEN                            PWM_INTEN_REG(PWMB,0)
#define PWMB_SM0DMAEN                            PWM_DMAEN_REG(PWMB,0)
#define PWMB_SM0TCTRL                            PWM_TCTRL_REG(PWMB,0)
#define PWMB_SM0DISMAP0                          PWM_DISMAP_REG(PWMB,0,0)
#define PWMB_SM0DISMAP1                          PWM_DISMAP_REG(PWMB,0,1)
#define PWMB_SM0DTCNT0                           PWM_DTCNT0_REG(PWMB,0)
#define PWMB_SM0DTCNT1                           PWM_DTCNT1_REG(PWMB,0)
#define PWMB_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMB,0)
#define PWMB_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMB,0)
#define PWMB_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMB,0)
#define PWMB_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMB,0)
#define PWMB_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMB,0)
#define PWMB_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMB,0)
#define PWMB_SM0CVAL0                            PWM_CVAL0_REG(PWMB,0)
#define PWMB_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWMB,0)
#define PWMB_SM0CVAL1                            PWM_CVAL1_REG(PWMB,0)
#define PWMB_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWMB,0)
#define PWMB_SM0CVAL2                            PWM_CVAL2_REG(PWMB,0)
#define PWMB_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWMB,0)
#define PWMB_SM0CVAL3                            PWM_CVAL3_REG(PWMB,0)
#define PWMB_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWMB,0)
#define PWMB_SM0CVAL4                            PWM_CVAL4_REG(PWMB,0)
#define PWMB_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWMB,0)
#define PWMB_SM0CVAL5                            PWM_CVAL5_REG(PWMB,0)
#define PWMB_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWMB,0)
#define PWMB_SM1CNT                              PWM_CNT_REG(PWMB,1)
#define PWMB_SM1INIT                             PWM_INIT_REG(PWMB,1)
#define PWMB_SM1CTRL2                            PWM_CTRL2_REG(PWMB,1)
#define PWMB_SM1CTRL                             PWM_CTRL_REG(PWMB,1)
#define PWMB_SM1VAL0                             PWM_VAL0_REG(PWMB,1)
#define PWMB_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWMB,1)
#define PWMB_SM1VAL1                             PWM_VAL1_REG(PWMB,1)
#define PWMB_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWMB,1)
#define PWMB_SM1VAL2                             PWM_VAL2_REG(PWMB,1)
#define PWMB_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWMB,1)
#define PWMB_SM1VAL3                             PWM_VAL3_REG(PWMB,1)
#define PWMB_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWMB,1)
#define PWMB_SM1VAL4                             PWM_VAL4_REG(PWMB,1)
#define PWMB_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWMB,1)
#define PWMB_SM1VAL5                             PWM_VAL5_REG(PWMB,1)
#define PWMB_SM1FRCTRL                           PWM_FRCTRL_REG(PWMB,1)
#define PWMB_SM1OCTRL                            PWM_OCTRL_REG(PWMB,1)
#define PWMB_SM1STS                              PWM_STS_REG(PWMB,1)
#define PWMB_SM1INTEN                            PWM_INTEN_REG(PWMB,1)
#define PWMB_SM1DMAEN                            PWM_DMAEN_REG(PWMB,1)
#define PWMB_SM1TCTRL                            PWM_TCTRL_REG(PWMB,1)
#define PWMB_SM1DISMAP0                          PWM_DISMAP_REG(PWMB,1,0)
#define PWMB_SM1DISMAP1                          PWM_DISMAP_REG(PWMB,1,1)
#define PWMB_SM1DTCNT0                           PWM_DTCNT0_REG(PWMB,1)
#define PWMB_SM1DTCNT1                           PWM_DTCNT1_REG(PWMB,1)
#define PWMB_SM1CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMB,1)
#define PWMB_SM1CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMB,1)
#define PWMB_SM1CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMB,1)
#define PWMB_SM1CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMB,1)
#define PWMB_SM1CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMB,1)
#define PWMB_SM1CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMB,1)
#define PWMB_SM1CVAL0                            PWM_CVAL0_REG(PWMB,1)
#define PWMB_SM1CVAL0CYC                         PWM_CVAL0CYC_REG(PWMB,1)
#define PWMB_SM1CVAL1                            PWM_CVAL1_REG(PWMB,1)
#define PWMB_SM1CVAL1CYC                         PWM_CVAL1CYC_REG(PWMB,1)
#define PWMB_SM1CVAL2                            PWM_CVAL2_REG(PWMB,1)
#define PWMB_SM1CVAL2CYC                         PWM_CVAL2CYC_REG(PWMB,1)
#define PWMB_SM1CVAL3                            PWM_CVAL3_REG(PWMB,1)
#define PWMB_SM1CVAL3CYC                         PWM_CVAL3CYC_REG(PWMB,1)
#define PWMB_SM1CVAL4                            PWM_CVAL4_REG(PWMB,1)
#define PWMB_SM1CVAL4CYC                         PWM_CVAL4CYC_REG(PWMB,1)
#define PWMB_SM1CVAL5                            PWM_CVAL5_REG(PWMB,1)
#define PWMB_SM1CVAL5CYC                         PWM_CVAL5CYC_REG(PWMB,1)
#define PWMB_SM2CNT                              PWM_CNT_REG(PWMB,2)
#define PWMB_SM2INIT                             PWM_INIT_REG(PWMB,2)
#define PWMB_SM2CTRL2                            PWM_CTRL2_REG(PWMB,2)
#define PWMB_SM2CTRL                             PWM_CTRL_REG(PWMB,2)
#define PWMB_SM2VAL0                             PWM_VAL0_REG(PWMB,2)
#define PWMB_SM2FRACVAL1                         PWM_FRACVAL1_REG(PWMB,2)
#define PWMB_SM2VAL1                             PWM_VAL1_REG(PWMB,2)
#define PWMB_SM2FRACVAL2                         PWM_FRACVAL2_REG(PWMB,2)
#define PWMB_SM2VAL2                             PWM_VAL2_REG(PWMB,2)
#define PWMB_SM2FRACVAL3                         PWM_FRACVAL3_REG(PWMB,2)
