pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22.h
#define PWMB_SM2VAL3                             PWM_VAL3_REG(PWMB,2)
#define PWMB_SM2FRACVAL4                         PWM_FRACVAL4_REG(PWMB,2)
#define PWMB_SM2VAL4                             PWM_VAL4_REG(PWMB,2)
#define PWMB_SM2FRACVAL5                         PWM_FRACVAL5_REG(PWMB,2)
#define PWMB_SM2VAL5                             PWM_VAL5_REG(PWMB,2)
#define PWMB_SM2FRCTRL                           PWM_FRCTRL_REG(PWMB,2)
#define PWMB_SM2OCTRL                            PWM_OCTRL_REG(PWMB,2)
#define PWMB_SM2STS                              PWM_STS_REG(PWMB,2)
#define PWMB_SM2INTEN                            PWM_INTEN_REG(PWMB,2)
#define PWMB_SM2DMAEN                            PWM_DMAEN_REG(PWMB,2)
#define PWMB_SM2TCTRL                            PWM_TCTRL_REG(PWMB,2)
#define PWMB_SM2DISMAP0                          PWM_DISMAP_REG(PWMB,2,0)
#define PWMB_SM2DISMAP1                          PWM_DISMAP_REG(PWMB,2,1)
#define PWMB_SM2DTCNT0                           PWM_DTCNT0_REG(PWMB,2)
#define PWMB_SM2DTCNT1                           PWM_DTCNT1_REG(PWMB,2)
#define PWMB_SM2CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMB,2)
#define PWMB_SM2CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMB,2)
#define PWMB_SM2CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMB,2)
#define PWMB_SM2CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMB,2)
#define PWMB_SM2CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMB,2)
#define PWMB_SM2CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMB,2)
#define PWMB_SM2CVAL0                            PWM_CVAL0_REG(PWMB,2)
#define PWMB_SM2CVAL0CYC                         PWM_CVAL0CYC_REG(PWMB,2)
#define PWMB_SM2CVAL1                            PWM_CVAL1_REG(PWMB,2)
#define PWMB_SM2CVAL1CYC                         PWM_CVAL1CYC_REG(PWMB,2)
#define PWMB_SM2CVAL2                            PWM_CVAL2_REG(PWMB,2)
#define PWMB_SM2CVAL2CYC                         PWM_CVAL2CYC_REG(PWMB,2)
#define PWMB_SM2CVAL3                            PWM_CVAL3_REG(PWMB,2)
#define PWMB_SM2CVAL3CYC                         PWM_CVAL3CYC_REG(PWMB,2)
#define PWMB_SM2CVAL4                            PWM_CVAL4_REG(PWMB,2)
#define PWMB_SM2CVAL4CYC                         PWM_CVAL4CYC_REG(PWMB,2)
#define PWMB_SM2CVAL5                            PWM_CVAL5_REG(PWMB,2)
#define PWMB_SM2CVAL5CYC                         PWM_CVAL5CYC_REG(PWMB,2)
#define PWMB_SM3CNT                              PWM_CNT_REG(PWMB,3)
#define PWMB_SM3INIT                             PWM_INIT_REG(PWMB,3)
#define PWMB_SM3CTRL2                            PWM_CTRL2_REG(PWMB,3)
#define PWMB_SM3CTRL                             PWM_CTRL_REG(PWMB,3)
#define PWMB_SM3VAL0                             PWM_VAL0_REG(PWMB,3)
#define PWMB_SM3FRACVAL1                         PWM_FRACVAL1_REG(PWMB,3)
#define PWMB_SM3VAL1                             PWM_VAL1_REG(PWMB,3)
#define PWMB_SM3FRACVAL2                         PWM_FRACVAL2_REG(PWMB,3)
#define PWMB_SM3VAL2                             PWM_VAL2_REG(PWMB,3)
#define PWMB_SM3FRACVAL3                         PWM_FRACVAL3_REG(PWMB,3)
#define PWMB_SM3VAL3                             PWM_VAL3_REG(PWMB,3)
#define PWMB_SM3FRACVAL4                         PWM_FRACVAL4_REG(PWMB,3)
#define PWMB_SM3VAL4                             PWM_VAL4_REG(PWMB,3)
#define PWMB_SM3FRACVAL5                         PWM_FRACVAL5_REG(PWMB,3)
#define PWMB_SM3VAL5                             PWM_VAL5_REG(PWMB,3)
#define PWMB_SM3FRCTRL                           PWM_FRCTRL_REG(PWMB,3)
#define PWMB_SM3OCTRL                            PWM_OCTRL_REG(PWMB,3)
#define PWMB_SM3STS                              PWM_STS_REG(PWMB,3)
#define PWMB_SM3INTEN                            PWM_INTEN_REG(PWMB,3)
#define PWMB_SM3DMAEN                            PWM_DMAEN_REG(PWMB,3)
#define PWMB_SM3TCTRL                            PWM_TCTRL_REG(PWMB,3)
#define PWMB_SM3DISMAP0                          PWM_DISMAP_REG(PWMB,3,0)
#define PWMB_SM3DISMAP1                          PWM_DISMAP_REG(PWMB,3,1)
#define PWMB_SM3DTCNT0                           PWM_DTCNT0_REG(PWMB,3)
#define PWMB_SM3DTCNT1                           PWM_DTCNT1_REG(PWMB,3)
#define PWMB_SM3CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWMB,3)
#define PWMB_SM3CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWMB,3)
#define PWMB_SM3CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWMB,3)
#define PWMB_SM3CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWMB,3)
#define PWMB_SM3CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWMB,3)
#define PWMB_SM3CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWMB,3)
#define PWMB_SM3CVAL0                            PWM_CVAL0_REG(PWMB,3)
#define PWMB_SM3CVAL0CYC                         PWM_CVAL0CYC_REG(PWMB,3)
#define PWMB_SM3CVAL1                            PWM_CVAL1_REG(PWMB,3)
#define PWMB_SM3CVAL1CYC                         PWM_CVAL1CYC_REG(PWMB,3)
#define PWMB_SM3CVAL2                            PWM_CVAL2_REG(PWMB,3)
#define PWMB_SM3CVAL2CYC                         PWM_CVAL2CYC_REG(PWMB,3)
#define PWMB_SM3CVAL3                            PWM_CVAL3_REG(PWMB,3)
#define PWMB_SM3CVAL3CYC                         PWM_CVAL3CYC_REG(PWMB,3)
#define PWMB_SM3CVAL4                            PWM_CVAL4_REG(PWMB,3)
#define PWMB_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWMB,3)
#define PWMB_SM3CVAL5                            PWM_CVAL5_REG(PWMB,3)
#define PWMB_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWMB,3)
#define PWMB_OUTEN                               PWM_OUTEN_REG(PWMB)
#define PWMB_MASK                                PWM_MASK_REG(PWMB)
#define PWMB_SWCOUT                              PWM_SWCOUT_REG(PWMB)
#define PWMB_DTSRCSEL                            PWM_DTSRCSEL_REG(PWMB)
#define PWMB_MCTRL                               PWM_MCTRL_REG(PWMB)
#define PWMB_FCTRL0                              PWM_FAULT_CTRL_REG(PWMB,0)
#define PWMB_FSTS0                               PWM_FAULT_STS_REG(PWMB,0)
#define PWMB_FFILT0                              PWM_FAULT_FILT_REG(PWMB,0)
#define PWMB_FTST0                               PWM_FAULT_TST_REG(PWMB,0)
#define PWMB_FCTRL1                              PWM_FAULT_CTRL_REG(PWMB,1)
#define PWMB_FSTS1                               PWM_FAULT_STS_REG(PWMB,1)
#define PWMB_FFILT1                              PWM_FAULT_FILT_REG(PWMB,1)
#define PWMB_FTST1                               PWM_FAULT_TST_REG(PWMB,1)

/* PWM - Register array accessors */
#define PWMA_CNT(index)                          PWM_CNT_REG(PWMA,index)
#define PWMB_CNT(index)                          PWM_CNT_REG(PWMB,index)
#define PWMA_INIT(index)                         PWM_INIT_REG(PWMA,index)
#define PWMB_INIT(index)                         PWM_INIT_REG(PWMB,index)
#define PWMA_CTRL2(index)                        PWM_CTRL2_REG(PWMA,index)
#define PWMB_CTRL2(index)                        PWM_CTRL2_REG(PWMB,index)
#define PWMA_CTRL(index)                         PWM_CTRL_REG(PWMA,index)
#define PWMB_CTRL(index)                         PWM_CTRL_REG(PWMB,index)
#define PWMA_VAL0(index)                         PWM_VAL0_REG(PWMA,index)
#define PWMB_VAL0(index)                         PWM_VAL0_REG(PWMB,index)
#define PWMA_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWMA,index)
#define PWMB_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWMB,index)
#define PWMA_VAL1(index)                         PWM_VAL1_REG(PWMA,index)
#define PWMB_VAL1(index)                         PWM_VAL1_REG(PWMB,index)
#define PWMA_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWMA,index)
#define PWMB_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWMB,index)
#define PWMA_VAL2(index)                         PWM_VAL2_REG(PWMA,index)
#define PWMB_VAL2(index)                         PWM_VAL2_REG(PWMB,index)
#define PWMA_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWMA,index)
#define PWMB_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWMB,index)
#define PWMA_VAL3(index)                         PWM_VAL3_REG(PWMA,index)
#define PWMB_VAL3(index)                         PWM_VAL3_REG(PWMB,index)
#define PWMA_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWMA,index)
#define PWMB_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWMB,index)
#define PWMA_VAL4(index)                         PWM_VAL4_REG(PWMA,index)
#define PWMB_VAL4(index)                         PWM_VAL4_REG(PWMB,index)
#define PWMA_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWMA,index)
#define PWMB_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWMB,index)
#define PWMA_VAL5(index)                         PWM_VAL5_REG(PWMA,index)
#define PWMB_VAL5(index)                         PWM_VAL5_REG(PWMB,index)
#define PWMA_FRCTRL(index)                       PWM_FRCTRL_REG(PWMA,index)
#define PWMB_FRCTRL(index)                       PWM_FRCTRL_REG(PWMB,index)
#define PWMA_OCTRL(index)                        PWM_OCTRL_REG(PWMA,index)
#define PWMB_OCTRL(index)                        PWM_OCTRL_REG(PWMB,index)
#define PWMA_STS(index)                          PWM_STS_REG(PWMA,index)
#define PWMB_STS(index)                          PWM_STS_REG(PWMB,index)
#define PWMA_INTEN(index)                        PWM_INTEN_REG(PWMA,index)
#define PWMB_INTEN(index)                        PWM_INTEN_REG(PWMB,index)
#define PWMA_DMAEN(index)                        PWM_DMAEN_REG(PWMA,index)
#define PWMB_DMAEN(index)                        PWM_DMAEN_REG(PWMB,index)
#define PWMA_TCTRL(index)                        PWM_TCTRL_REG(PWMA,index)
#define PWMB_TCTRL(index)                        PWM_TCTRL_REG(PWMB,index)
#define PWMA_DISMAP(index,index2)                PWM_DISMAP_REG(PWMA,index,index2)
#define PWMB_DISMAP(index,index2)                PWM_DISMAP_REG(PWMB,index,index2)
#define PWMA_DTCNT0(index)                       PWM_DTCNT0_REG(PWMA,index)
#define PWMB_DTCNT0(index)                       PWM_DTCNT0_REG(PWMB,index)
#define PWMA_DTCNT1(index)                       PWM_DTCNT1_REG(PWMA,index)
#define PWMB_DTCNT1(index)                       PWM_DTCNT1_REG(PWMB,index)
#define PWMA_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWMA,index)
#define PWMB_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWMB,index)
#define PWMA_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWMA,index)
#define PWMB_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWMB,index)
#define PWMA_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWMA,index)
#define PWMB_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWMB,index)
#define PWMA_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWMA,index)
#define PWMB_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWMB,index)
#define PWMA_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWMA,index)
#define PWMB_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWMB,index)
#define PWMA_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWMA,index)
#define PWMB_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWMB,index)
#define PWMA_CVAL0(index)                        PWM_CVAL0_REG(PWMA,index)
#define PWMB_CVAL0(index)                        PWM_CVAL0_REG(PWMB,index)
#define PWMA_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWMA,index)
#define PWMB_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWMB,index)
#define PWMA_CVAL1(index)                        PWM_CVAL1_REG(PWMA,index)
#define PWMB_CVAL1(index)                        PWM_CVAL1_REG(PWMB,index)
#define PWMA_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWMA,index)
#define PWMB_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWMB,index)
#define PWMA_CVAL2(index)                        PWM_CVAL2_REG(PWMA,index)
#define PWMB_CVAL2(index)                        PWM_CVAL2_REG(PWMB,index)
#define PWMA_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWMA,index)
#define PWMB_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWMB,index)
#define PWMA_CVAL3(index)                        PWM_CVAL3_REG(PWMA,index)
#define PWMB_CVAL3(index)                        PWM_CVAL3_REG(PWMB,index)
#define PWMA_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWMA,index)
#define PWMB_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWMB,index)
#define PWMA_CVAL4(index)                        PWM_CVAL4_REG(PWMA,index)
#define PWMB_CVAL4(index)                        PWM_CVAL4_REG(PWMB,index)
#define PWMA_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWMA,index)
#define PWMB_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWMB,index)
#define PWMA_CVAL5(index)                        PWM_CVAL5_REG(PWMA,index)
#define PWMB_CVAL5(index)                        PWM_CVAL5_REG(PWMB,index)
#define PWMA_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWMA,index)
#define PWMB_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWMB,index)
#define PWMA_FAULT_CTRL(index)                   PWM_FAULT_CTRL_REG(PWMA,index)
#define PWMB_FAULT_CTRL(index)                   PWM_FAULT_CTRL_REG(PWMB,index)
#define PWMA_FAULT_STS(index)                    PWM_FAULT_STS_REG(PWMA,index)
#define PWMB_FAULT_STS(index)                    PWM_FAULT_STS_REG(PWMB,index)
#define PWMA_FAULT_FILT(index)                   PWM_FAULT_FILT_REG(PWMA,index)
#define PWMB_FAULT_FILT(index)                   PWM_FAULT_FILT_REG(PWMB,index)
#define PWMA_FAULT_TST(index)                    PWM_FAULT_TST_REG(PWMA,index)
#define PWMB_FAULT_TST(index)                    PWM_FAULT_TST_REG(PWMB,index)
#define PWMA_FAULT_CTRL2(index)                  PWM_FAULT_CTRL2_REG(PWMA,index)

/*!
 * @}
 */ /* end of group PWM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group PWM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Peripheral_Access_Layer RCM Peripheral Access Layer
 * @{
 */

/** RCM - Register Layout Typedef */
typedef struct {
  __I  uint8_t SRS0;                               /**< System Reset Status Register 0, offset: 0x0 */
  __I  uint8_t SRS1;                               /**< System Reset Status Register 1, offset: 0x1 */
       uint8_t RESERVED_0[2];
  __IO uint8_t RPFC;                               /**< Reset Pin Filter Control register, offset: 0x4 */
  __IO uint8_t RPFW;                               /**< Reset Pin Filter Width register, offset: 0x5 */
       uint8_t RESERVED_1[2];
  __IO uint8_t SSRS0;                              /**< Sticky System Reset Status Register 0, offset: 0x8 */
  __IO uint8_t SSRS1;                              /**< Sticky System Reset Status Register 1, offset: 0x9 */
} RCM_Type, *RCM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- RCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Accessor_Macros RCM - Register accessor macros
 * @{
 */


/* RCM - Register accessors */
#define RCM_SRS0_REG(base)                       ((base)->SRS0)
#define RCM_SRS1_REG(base)                       ((base)->SRS1)
#define RCM_RPFC_REG(base)                       ((base)->RPFC)
#define RCM_RPFW_REG(base)                       ((base)->RPFW)
#define RCM_SSRS0_REG(base)                      ((base)->SSRS0)
#define RCM_SSRS1_REG(base)                      ((base)->SSRS1)

/*!
 * @}
 */ /* end of group RCM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- RCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Masks RCM Register Masks
 * @{
 */

/* SRS0 Bit Fields */
#define RCM_SRS0_WAKEUP_MASK                     0x1u
#define RCM_SRS0_WAKEUP_SHIFT                    0
#define RCM_SRS0_WAKEUP_WIDTH                    1
#define RCM_SRS0_WAKEUP(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_WAKEUP_SHIFT))&RCM_SRS0_WAKEUP_MASK)
#define RCM_SRS0_LVD_MASK                        0x2u
#define RCM_SRS0_LVD_SHIFT                       1
#define RCM_SRS0_LVD_WIDTH                       1
#define RCM_SRS0_LVD(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_LVD_SHIFT))&RCM_SRS0_LVD_MASK)
#define RCM_SRS0_LOC_MASK                        0x4u
#define RCM_SRS0_LOC_SHIFT                       2
#define RCM_SRS0_LOC_WIDTH                       1
#define RCM_SRS0_LOC(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_LOC_SHIFT))&RCM_SRS0_LOC_MASK)
#define RCM_SRS0_LOL_MASK                        0x8u
#define RCM_SRS0_LOL_SHIFT                       3
#define RCM_SRS0_LOL_WIDTH                       1
#define RCM_SRS0_LOL(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_LOL_SHIFT))&RCM_SRS0_LOL_MASK)
#define RCM_SRS0_WDOG_MASK                       0x20u
#define RCM_SRS0_WDOG_SHIFT                      5
#define RCM_SRS0_WDOG_WIDTH                      1
#define RCM_SRS0_WDOG(x)                         (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_WDOG_SHIFT))&RCM_SRS0_WDOG_MASK)
#define RCM_SRS0_PIN_MASK                        0x40u
#define RCM_SRS0_PIN_SHIFT                       6
#define RCM_SRS0_PIN_WIDTH                       1
#define RCM_SRS0_PIN(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_PIN_SHIFT))&RCM_SRS0_PIN_MASK)
#define RCM_SRS0_POR_MASK                        0x80u
#define RCM_SRS0_POR_SHIFT                       7
#define RCM_SRS0_POR_WIDTH                       1
#define RCM_SRS0_POR(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_POR_SHIFT))&RCM_SRS0_POR_MASK)
/* SRS1 Bit Fields */
#define RCM_SRS1_JTAG_MASK                       0x1u
#define RCM_SRS1_JTAG_SHIFT                      0
#define RCM_SRS1_JTAG_WIDTH                      1
#define RCM_SRS1_JTAG(x)                         (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_JTAG_SHIFT))&RCM_SRS1_JTAG_MASK)
#define RCM_SRS1_LOCKUP_MASK                     0x2u
#define RCM_SRS1_LOCKUP_SHIFT                    1
#define RCM_SRS1_LOCKUP_WIDTH                    1
#define RCM_SRS1_LOCKUP(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_LOCKUP_SHIFT))&RCM_SRS1_LOCKUP_MASK)
#define RCM_SRS1_SW_MASK                         0x4u
#define RCM_SRS1_SW_SHIFT                        2
#define RCM_SRS1_SW_WIDTH                        1
#define RCM_SRS1_SW(x)                           (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_SW_SHIFT))&RCM_SRS1_SW_MASK)
#define RCM_SRS1_MDM_AP_MASK                     0x8u
#define RCM_SRS1_MDM_AP_SHIFT                    3
#define RCM_SRS1_MDM_AP_WIDTH                    1
#define RCM_SRS1_MDM_AP(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_MDM_AP_SHIFT))&RCM_SRS1_MDM_AP_MASK)
#define RCM_SRS1_SACKERR_MASK                    0x20u
#define RCM_SRS1_SACKERR_SHIFT                   5
#define RCM_SRS1_SACKERR_WIDTH                   1
#define RCM_SRS1_SACKERR(x)                      (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_SACKERR_SHIFT))&RCM_SRS1_SACKERR_MASK)
/* RPFC Bit Fields */
#define RCM_RPFC_RSTFLTSRW_MASK                  0x3u
#define RCM_RPFC_RSTFLTSRW_SHIFT                 0
#define RCM_RPFC_RSTFLTSRW_WIDTH                 2
#define RCM_RPFC_RSTFLTSRW(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK)
#define RCM_RPFC_RSTFLTSS_MASK                   0x4u
#define RCM_RPFC_RSTFLTSS_SHIFT                  2
#define RCM_RPFC_RSTFLTSS_WIDTH                  1
#define RCM_RPFC_RSTFLTSS(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSS_SHIFT))&RCM_RPFC_RSTFLTSS_MASK)
/* RPFW Bit Fields */
#define RCM_RPFW_RSTFLTSEL_MASK                  0x1Fu
#define RCM_RPFW_RSTFLTSEL_SHIFT                 0
#define RCM_RPFW_RSTFLTSEL_WIDTH                 5
#define RCM_RPFW_RSTFLTSEL(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSEL_SHIFT))&RCM_RPFW_RSTFLTSEL_MASK)
/* SSRS0 Bit Fields */
#define RCM_SSRS0_SWAKEUP_MASK                   0x1u
#define RCM_SSRS0_SWAKEUP_SHIFT                  0
#define RCM_SSRS0_SWAKEUP_WIDTH                  1
#define RCM_SSRS0_SWAKEUP(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SWAKEUP_SHIFT))&RCM_SSRS0_SWAKEUP_MASK)
#define RCM_SSRS0_SLVD_MASK                      0x2u
#define RCM_SSRS0_SLVD_SHIFT                     1
#define RCM_SSRS0_SLVD_WIDTH                     1
#define RCM_SSRS0_SLVD(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SLVD_SHIFT))&RCM_SSRS0_SLVD_MASK)
#define RCM_SSRS0_SLOC_MASK                      0x4u
#define RCM_SSRS0_SLOC_SHIFT                     2
#define RCM_SSRS0_SLOC_WIDTH                     1
#define RCM_SSRS0_SLOC(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SLOC_SHIFT))&RCM_SSRS0_SLOC_MASK)
#define RCM_SSRS0_SLOL_MASK                      0x8u
#define RCM_SSRS0_SLOL_SHIFT                     3
#define RCM_SSRS0_SLOL_WIDTH                     1
#define RCM_SSRS0_SLOL(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SLOL_SHIFT))&RCM_SSRS0_SLOL_MASK)
#define RCM_SSRS0_SWDOG_MASK                     0x20u
#define RCM_SSRS0_SWDOG_SHIFT                    5
#define RCM_SSRS0_SWDOG_WIDTH                    1
#define RCM_SSRS0_SWDOG(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SWDOG_SHIFT))&RCM_SSRS0_SWDOG_MASK)
#define RCM_SSRS0_SPIN_MASK                      0x40u
#define RCM_SSRS0_SPIN_SHIFT                     6
#define RCM_SSRS0_SPIN_WIDTH                     1
#define RCM_SSRS0_SPIN(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SPIN_SHIFT))&RCM_SSRS0_SPIN_MASK)
#define RCM_SSRS0_SPOR_MASK                      0x80u
#define RCM_SSRS0_SPOR_SHIFT                     7
#define RCM_SSRS0_SPOR_WIDTH                     1
#define RCM_SSRS0_SPOR(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SPOR_SHIFT))&RCM_SSRS0_SPOR_MASK)
/* SSRS1 Bit Fields */
#define RCM_SSRS1_SJTAG_MASK                     0x1u
#define RCM_SSRS1_SJTAG_SHIFT                    0
#define RCM_SSRS1_SJTAG_WIDTH                    1
#define RCM_SSRS1_SJTAG(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SJTAG_SHIFT))&RCM_SSRS1_SJTAG_MASK)
#define RCM_SSRS1_SLOCKUP_MASK                   0x2u
#define RCM_SSRS1_SLOCKUP_SHIFT                  1
#define RCM_SSRS1_SLOCKUP_WIDTH                  1
#define RCM_SSRS1_SLOCKUP(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SLOCKUP_SHIFT))&RCM_SSRS1_SLOCKUP_MASK)
#define RCM_SSRS1_SSW_MASK                       0x4u
#define RCM_SSRS1_SSW_SHIFT                      2
#define RCM_SSRS1_SSW_WIDTH                      1
#define RCM_SSRS1_SSW(x)                         (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SSW_SHIFT))&RCM_SSRS1_SSW_MASK)
#define RCM_SSRS1_SMDM_AP_MASK                   0x8u
#define RCM_SSRS1_SMDM_AP_SHIFT                  3
#define RCM_SSRS1_SMDM_AP_WIDTH                  1
#define RCM_SSRS1_SMDM_AP(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SMDM_AP_SHIFT))&RCM_SSRS1_SMDM_AP_MASK)
#define RCM_SSRS1_SSACKERR_MASK                  0x20u
#define RCM_SSRS1_SSACKERR_SHIFT                 5
#define RCM_SSRS1_SSACKERR_WIDTH                 1
#define RCM_SSRS1_SSACKERR(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SSACKERR_SHIFT))&RCM_SSRS1_SSACKERR_MASK)

/*!
 * @}
 */ /* end of group RCM_Register_Masks */


