pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22.h
/* RTMCTL Bit Fields */
#define TRNG_RTMCTL_SAMP_MODE_MASK               0x3u
#define TRNG_RTMCTL_SAMP_MODE_SHIFT              0
#define TRNG_RTMCTL_SAMP_MODE_WIDTH              2
#define TRNG_RTMCTL_SAMP_MODE(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_SAMP_MODE_SHIFT))&TRNG_RTMCTL_SAMP_MODE_MASK)
#define TRNG_RTMCTL_OSC_DIV_MASK                 0xCu
#define TRNG_RTMCTL_OSC_DIV_SHIFT                2
#define TRNG_RTMCTL_OSC_DIV_WIDTH                2
#define TRNG_RTMCTL_OSC_DIV(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_OSC_DIV_SHIFT))&TRNG_RTMCTL_OSC_DIV_MASK)
#define TRNG_RTMCTL_UNUSED_MASK                  0x10u
#define TRNG_RTMCTL_UNUSED_SHIFT                 4
#define TRNG_RTMCTL_UNUSED_WIDTH                 1
#define TRNG_RTMCTL_UNUSED(x)                    (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_UNUSED_SHIFT))&TRNG_RTMCTL_UNUSED_MASK)
#define TRNG_RTMCTL_TRNG_ACC_MASK                0x20u
#define TRNG_RTMCTL_TRNG_ACC_SHIFT               5
#define TRNG_RTMCTL_TRNG_ACC_WIDTH               1
#define TRNG_RTMCTL_TRNG_ACC(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_TRNG_ACC_SHIFT))&TRNG_RTMCTL_TRNG_ACC_MASK)
#define TRNG_RTMCTL_RST_DEF_MASK                 0x40u
#define TRNG_RTMCTL_RST_DEF_SHIFT                6
#define TRNG_RTMCTL_RST_DEF_WIDTH                1
#define TRNG_RTMCTL_RST_DEF(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_RST_DEF_SHIFT))&TRNG_RTMCTL_RST_DEF_MASK)
#define TRNG_RTMCTL_FOR_SCLK_MASK                0x80u
#define TRNG_RTMCTL_FOR_SCLK_SHIFT               7
#define TRNG_RTMCTL_FOR_SCLK_WIDTH               1
#define TRNG_RTMCTL_FOR_SCLK(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_FOR_SCLK_SHIFT))&TRNG_RTMCTL_FOR_SCLK_MASK)
#define TRNG_RTMCTL_FCT_FAIL_MASK                0x100u
#define TRNG_RTMCTL_FCT_FAIL_SHIFT               8
#define TRNG_RTMCTL_FCT_FAIL_WIDTH               1
#define TRNG_RTMCTL_FCT_FAIL(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_FCT_FAIL_SHIFT))&TRNG_RTMCTL_FCT_FAIL_MASK)
#define TRNG_RTMCTL_FCT_VAL_MASK                 0x200u
#define TRNG_RTMCTL_FCT_VAL_SHIFT                9
#define TRNG_RTMCTL_FCT_VAL_WIDTH                1
#define TRNG_RTMCTL_FCT_VAL(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_FCT_VAL_SHIFT))&TRNG_RTMCTL_FCT_VAL_MASK)
#define TRNG_RTMCTL_ENT_VAL_MASK                 0x400u
#define TRNG_RTMCTL_ENT_VAL_SHIFT                10
#define TRNG_RTMCTL_ENT_VAL_WIDTH                1
#define TRNG_RTMCTL_ENT_VAL(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_ENT_VAL_SHIFT))&TRNG_RTMCTL_ENT_VAL_MASK)
#define TRNG_RTMCTL_TST_OUT_MASK                 0x800u
#define TRNG_RTMCTL_TST_OUT_SHIFT                11
#define TRNG_RTMCTL_TST_OUT_WIDTH                1
#define TRNG_RTMCTL_TST_OUT(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_TST_OUT_SHIFT))&TRNG_RTMCTL_TST_OUT_MASK)
#define TRNG_RTMCTL_ERR_MASK                     0x1000u
#define TRNG_RTMCTL_ERR_SHIFT                    12
#define TRNG_RTMCTL_ERR_WIDTH                    1
#define TRNG_RTMCTL_ERR(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_ERR_SHIFT))&TRNG_RTMCTL_ERR_MASK)
#define TRNG_RTMCTL_TSTOP_OK_MASK                0x2000u
#define TRNG_RTMCTL_TSTOP_OK_SHIFT               13
#define TRNG_RTMCTL_TSTOP_OK_WIDTH               1
#define TRNG_RTMCTL_TSTOP_OK(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_TSTOP_OK_SHIFT))&TRNG_RTMCTL_TSTOP_OK_MASK)
#define TRNG_RTMCTL_PRGM_MASK                    0x10000u
#define TRNG_RTMCTL_PRGM_SHIFT                   16
#define TRNG_RTMCTL_PRGM_WIDTH                   1
#define TRNG_RTMCTL_PRGM(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTMCTL_PRGM_SHIFT))&TRNG_RTMCTL_PRGM_MASK)
/* RTSCMISC Bit Fields */
#define TRNG_RTSCMISC_LRUN_MAX_MASK              0xFFu
#define TRNG_RTSCMISC_LRUN_MAX_SHIFT             0
#define TRNG_RTSCMISC_LRUN_MAX_WIDTH             8
#define TRNG_RTSCMISC_LRUN_MAX(x)                (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCMISC_LRUN_MAX_SHIFT))&TRNG_RTSCMISC_LRUN_MAX_MASK)
#define TRNG_RTSCMISC_RTY_CT_MASK                0xF0000u
#define TRNG_RTSCMISC_RTY_CT_SHIFT               16
#define TRNG_RTSCMISC_RTY_CT_WIDTH               4
#define TRNG_RTSCMISC_RTY_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCMISC_RTY_CT_SHIFT))&TRNG_RTSCMISC_RTY_CT_MASK)
/* RTPKRRNG Bit Fields */
#define TRNG_RTPKRRNG_PKR_RNG_MASK               0xFFFFu
#define TRNG_RTPKRRNG_PKR_RNG_SHIFT              0
#define TRNG_RTPKRRNG_PKR_RNG_WIDTH              16
#define TRNG_RTPKRRNG_PKR_RNG(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRRNG_PKR_RNG_SHIFT))&TRNG_RTPKRRNG_PKR_RNG_MASK)
/* RTPKRMAX Bit Fields */
#define TRNG_RTPKRMAX_PKR_MAX_MASK               0xFFFFFFu
#define TRNG_RTPKRMAX_PKR_MAX_SHIFT              0
#define TRNG_RTPKRMAX_PKR_MAX_WIDTH              24
#define TRNG_RTPKRMAX_PKR_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRMAX_PKR_MAX_SHIFT))&TRNG_RTPKRMAX_PKR_MAX_MASK)
/* RTPKRSQ Bit Fields */
#define TRNG_RTPKRSQ_PKR_SQ_MASK                 0xFFFFFFu
#define TRNG_RTPKRSQ_PKR_SQ_SHIFT                0
#define TRNG_RTPKRSQ_PKR_SQ_WIDTH                24
#define TRNG_RTPKRSQ_PKR_SQ(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRSQ_PKR_SQ_SHIFT))&TRNG_RTPKRSQ_PKR_SQ_MASK)
/* RTSDCTL Bit Fields */
#define TRNG_RTSDCTL_SAMP_SIZE_MASK              0xFFFFu
#define TRNG_RTSDCTL_SAMP_SIZE_SHIFT             0
#define TRNG_RTSDCTL_SAMP_SIZE_WIDTH             16
#define TRNG_RTSDCTL_SAMP_SIZE(x)                (((uint32_t)(((uint32_t)(x))<<TRNG_RTSDCTL_SAMP_SIZE_SHIFT))&TRNG_RTSDCTL_SAMP_SIZE_MASK)
#define TRNG_RTSDCTL_ENT_DLY_MASK                0xFFFF0000u
#define TRNG_RTSDCTL_ENT_DLY_SHIFT               16
#define TRNG_RTSDCTL_ENT_DLY_WIDTH               16
#define TRNG_RTSDCTL_ENT_DLY(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSDCTL_ENT_DLY_SHIFT))&TRNG_RTSDCTL_ENT_DLY_MASK)
/* RTSBLIM Bit Fields */
#define TRNG_RTSBLIM_SB_LIM_MASK                 0x3FFu
#define TRNG_RTSBLIM_SB_LIM_SHIFT                0
#define TRNG_RTSBLIM_SB_LIM_WIDTH                10
#define TRNG_RTSBLIM_SB_LIM(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTSBLIM_SB_LIM_SHIFT))&TRNG_RTSBLIM_SB_LIM_MASK)
/* RTTOTSAM Bit Fields */
#define TRNG_RTTOTSAM_TOT_SAM_MASK               0xFFFFFu
#define TRNG_RTTOTSAM_TOT_SAM_SHIFT              0
#define TRNG_RTTOTSAM_TOT_SAM_WIDTH              20
#define TRNG_RTTOTSAM_TOT_SAM(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTTOTSAM_TOT_SAM_SHIFT))&TRNG_RTTOTSAM_TOT_SAM_MASK)
/* RTFRQMIN Bit Fields */
#define TRNG_RTFRQMIN_FRQ_MIN_MASK               0x3FFFFFu
#define TRNG_RTFRQMIN_FRQ_MIN_SHIFT              0
#define TRNG_RTFRQMIN_FRQ_MIN_WIDTH              22
#define TRNG_RTFRQMIN_FRQ_MIN(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTFRQMIN_FRQ_MIN_SHIFT))&TRNG_RTFRQMIN_FRQ_MIN_MASK)
/* RTFRQCNT Bit Fields */
#define TRNG_RTFRQCNT_FRQ_CT_MASK                0x3FFFFFu
#define TRNG_RTFRQCNT_FRQ_CT_SHIFT               0
#define TRNG_RTFRQCNT_FRQ_CT_WIDTH               22
#define TRNG_RTFRQCNT_FRQ_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTFRQCNT_FRQ_CT_SHIFT))&TRNG_RTFRQCNT_FRQ_CT_MASK)
/* RTFRQMAX Bit Fields */
#define TRNG_RTFRQMAX_FRQ_MAX_MASK               0x3FFFFFu
#define TRNG_RTFRQMAX_FRQ_MAX_SHIFT              0
#define TRNG_RTFRQMAX_FRQ_MAX_WIDTH              22
#define TRNG_RTFRQMAX_FRQ_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTFRQMAX_FRQ_MAX_SHIFT))&TRNG_RTFRQMAX_FRQ_MAX_MASK)
/* RTSCMC Bit Fields */
#define TRNG_RTSCMC_MONO_CT_MASK                 0xFFFFu
#define TRNG_RTSCMC_MONO_CT_SHIFT                0
#define TRNG_RTSCMC_MONO_CT_WIDTH                16
#define TRNG_RTSCMC_MONO_CT(x)                   (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCMC_MONO_CT_SHIFT))&TRNG_RTSCMC_MONO_CT_MASK)
/* RTSCML Bit Fields */
#define TRNG_RTSCML_MONO_MAX_MASK                0xFFFFu
#define TRNG_RTSCML_MONO_MAX_SHIFT               0
#define TRNG_RTSCML_MONO_MAX_WIDTH               16
#define TRNG_RTSCML_MONO_MAX(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCML_MONO_MAX_SHIFT))&TRNG_RTSCML_MONO_MAX_MASK)
#define TRNG_RTSCML_MONO_RNG_MASK                0xFFFF0000u
#define TRNG_RTSCML_MONO_RNG_SHIFT               16
#define TRNG_RTSCML_MONO_RNG_WIDTH               16
#define TRNG_RTSCML_MONO_RNG(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCML_MONO_RNG_SHIFT))&TRNG_RTSCML_MONO_RNG_MASK)
/* RTSCR1C Bit Fields */
#define TRNG_RTSCR1C_R1_0_CT_MASK                0x7FFFu
#define TRNG_RTSCR1C_R1_0_CT_SHIFT               0
#define TRNG_RTSCR1C_R1_0_CT_WIDTH               15
#define TRNG_RTSCR1C_R1_0_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR1C_R1_0_CT_SHIFT))&TRNG_RTSCR1C_R1_0_CT_MASK)
#define TRNG_RTSCR1C_R1_1_CT_MASK                0x7FFF0000u
#define TRNG_RTSCR1C_R1_1_CT_SHIFT               16
#define TRNG_RTSCR1C_R1_1_CT_WIDTH               15
#define TRNG_RTSCR1C_R1_1_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR1C_R1_1_CT_SHIFT))&TRNG_RTSCR1C_R1_1_CT_MASK)
/* RTSCR1L Bit Fields */
#define TRNG_RTSCR1L_RUN1_MAX_MASK               0x7FFFu
#define TRNG_RTSCR1L_RUN1_MAX_SHIFT              0
#define TRNG_RTSCR1L_RUN1_MAX_WIDTH              15
#define TRNG_RTSCR1L_RUN1_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR1L_RUN1_MAX_SHIFT))&TRNG_RTSCR1L_RUN1_MAX_MASK)
#define TRNG_RTSCR1L_RUN1_RNG_MASK               0x7FFF0000u
#define TRNG_RTSCR1L_RUN1_RNG_SHIFT              16
#define TRNG_RTSCR1L_RUN1_RNG_WIDTH              15
#define TRNG_RTSCR1L_RUN1_RNG(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR1L_RUN1_RNG_SHIFT))&TRNG_RTSCR1L_RUN1_RNG_MASK)
/* RTSCR2C Bit Fields */
#define TRNG_RTSCR2C_R2_0_CT_MASK                0x3FFFu
#define TRNG_RTSCR2C_R2_0_CT_SHIFT               0
#define TRNG_RTSCR2C_R2_0_CT_WIDTH               14
#define TRNG_RTSCR2C_R2_0_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR2C_R2_0_CT_SHIFT))&TRNG_RTSCR2C_R2_0_CT_MASK)
#define TRNG_RTSCR2C_R2_1_CT_MASK                0x3FFF0000u
#define TRNG_RTSCR2C_R2_1_CT_SHIFT               16
#define TRNG_RTSCR2C_R2_1_CT_WIDTH               14
#define TRNG_RTSCR2C_R2_1_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR2C_R2_1_CT_SHIFT))&TRNG_RTSCR2C_R2_1_CT_MASK)
/* RTSCR2L Bit Fields */
#define TRNG_RTSCR2L_RUN2_MAX_MASK               0x3FFFu
#define TRNG_RTSCR2L_RUN2_MAX_SHIFT              0
#define TRNG_RTSCR2L_RUN2_MAX_WIDTH              14
#define TRNG_RTSCR2L_RUN2_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR2L_RUN2_MAX_SHIFT))&TRNG_RTSCR2L_RUN2_MAX_MASK)
#define TRNG_RTSCR2L_RUN2_RNG_MASK               0x3FFF0000u
#define TRNG_RTSCR2L_RUN2_RNG_SHIFT              16
#define TRNG_RTSCR2L_RUN2_RNG_WIDTH              14
#define TRNG_RTSCR2L_RUN2_RNG(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR2L_RUN2_RNG_SHIFT))&TRNG_RTSCR2L_RUN2_RNG_MASK)
/* RTSCR3C Bit Fields */
#define TRNG_RTSCR3C_R3_0_CT_MASK                0x1FFFu
#define TRNG_RTSCR3C_R3_0_CT_SHIFT               0
#define TRNG_RTSCR3C_R3_0_CT_WIDTH               13
#define TRNG_RTSCR3C_R3_0_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR3C_R3_0_CT_SHIFT))&TRNG_RTSCR3C_R3_0_CT_MASK)
#define TRNG_RTSCR3C_R3_1_CT_MASK                0x1FFF0000u
#define TRNG_RTSCR3C_R3_1_CT_SHIFT               16
#define TRNG_RTSCR3C_R3_1_CT_WIDTH               13
#define TRNG_RTSCR3C_R3_1_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR3C_R3_1_CT_SHIFT))&TRNG_RTSCR3C_R3_1_CT_MASK)
/* RTSCR3L Bit Fields */
#define TRNG_RTSCR3L_RUN3_MAX_MASK               0x1FFFu
#define TRNG_RTSCR3L_RUN3_MAX_SHIFT              0
#define TRNG_RTSCR3L_RUN3_MAX_WIDTH              13
#define TRNG_RTSCR3L_RUN3_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR3L_RUN3_MAX_SHIFT))&TRNG_RTSCR3L_RUN3_MAX_MASK)
#define TRNG_RTSCR3L_RUN3_RNG_MASK               0x1FFF0000u
#define TRNG_RTSCR3L_RUN3_RNG_SHIFT              16
#define TRNG_RTSCR3L_RUN3_RNG_WIDTH              13
#define TRNG_RTSCR3L_RUN3_RNG(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR3L_RUN3_RNG_SHIFT))&TRNG_RTSCR3L_RUN3_RNG_MASK)
/* RTSCR4C Bit Fields */
#define TRNG_RTSCR4C_R4_0_CT_MASK                0xFFFu
#define TRNG_RTSCR4C_R4_0_CT_SHIFT               0
#define TRNG_RTSCR4C_R4_0_CT_WIDTH               12
#define TRNG_RTSCR4C_R4_0_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR4C_R4_0_CT_SHIFT))&TRNG_RTSCR4C_R4_0_CT_MASK)
#define TRNG_RTSCR4C_R4_1_CT_MASK                0xFFF0000u
#define TRNG_RTSCR4C_R4_1_CT_SHIFT               16
#define TRNG_RTSCR4C_R4_1_CT_WIDTH               12
#define TRNG_RTSCR4C_R4_1_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR4C_R4_1_CT_SHIFT))&TRNG_RTSCR4C_R4_1_CT_MASK)
/* RTSCR4L Bit Fields */
#define TRNG_RTSCR4L_RUN4_MAX_MASK               0xFFFu
#define TRNG_RTSCR4L_RUN4_MAX_SHIFT              0
#define TRNG_RTSCR4L_RUN4_MAX_WIDTH              12
#define TRNG_RTSCR4L_RUN4_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR4L_RUN4_MAX_SHIFT))&TRNG_RTSCR4L_RUN4_MAX_MASK)
#define TRNG_RTSCR4L_RUN4_RNG_MASK               0xFFF0000u
#define TRNG_RTSCR4L_RUN4_RNG_SHIFT              16
#define TRNG_RTSCR4L_RUN4_RNG_WIDTH              12
#define TRNG_RTSCR4L_RUN4_RNG(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR4L_RUN4_RNG_SHIFT))&TRNG_RTSCR4L_RUN4_RNG_MASK)
/* RTSCR5C Bit Fields */
#define TRNG_RTSCR5C_R5_0_CT_MASK                0x7FFu
#define TRNG_RTSCR5C_R5_0_CT_SHIFT               0
#define TRNG_RTSCR5C_R5_0_CT_WIDTH               11
#define TRNG_RTSCR5C_R5_0_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR5C_R5_0_CT_SHIFT))&TRNG_RTSCR5C_R5_0_CT_MASK)
#define TRNG_RTSCR5C_R5_1_CT_MASK                0x7FF0000u
#define TRNG_RTSCR5C_R5_1_CT_SHIFT               16
#define TRNG_RTSCR5C_R5_1_CT_WIDTH               11
#define TRNG_RTSCR5C_R5_1_CT(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR5C_R5_1_CT_SHIFT))&TRNG_RTSCR5C_R5_1_CT_MASK)
/* RTSCR5L Bit Fields */
#define TRNG_RTSCR5L_RUN5_MAX_MASK               0x7FFu
#define TRNG_RTSCR5L_RUN5_MAX_SHIFT              0
#define TRNG_RTSCR5L_RUN5_MAX_WIDTH              11
#define TRNG_RTSCR5L_RUN5_MAX(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR5L_RUN5_MAX_SHIFT))&TRNG_RTSCR5L_RUN5_MAX_MASK)
#define TRNG_RTSCR5L_RUN5_RNG_MASK               0x7FF0000u
#define TRNG_RTSCR5L_RUN5_RNG_SHIFT              16
#define TRNG_RTSCR5L_RUN5_RNG_WIDTH              11
#define TRNG_RTSCR5L_RUN5_RNG(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR5L_RUN5_RNG_SHIFT))&TRNG_RTSCR5L_RUN5_RNG_MASK)
/* RTSCR6PC Bit Fields */
#define TRNG_RTSCR6PC_R6P_0_CT_MASK              0x7FFu
#define TRNG_RTSCR6PC_R6P_0_CT_SHIFT             0
#define TRNG_RTSCR6PC_R6P_0_CT_WIDTH             11
#define TRNG_RTSCR6PC_R6P_0_CT(x)                (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR6PC_R6P_0_CT_SHIFT))&TRNG_RTSCR6PC_R6P_0_CT_MASK)
#define TRNG_RTSCR6PC_R6P_1_CT_MASK              0x7FF0000u
#define TRNG_RTSCR6PC_R6P_1_CT_SHIFT             16
#define TRNG_RTSCR6PC_R6P_1_CT_WIDTH             11
#define TRNG_RTSCR6PC_R6P_1_CT(x)                (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR6PC_R6P_1_CT_SHIFT))&TRNG_RTSCR6PC_R6P_1_CT_MASK)
/* RTSCR6PL Bit Fields */
#define TRNG_RTSCR6PL_RUN6P_MAX_MASK             0x7FFu
#define TRNG_RTSCR6PL_RUN6P_MAX_SHIFT            0
#define TRNG_RTSCR6PL_RUN6P_MAX_WIDTH            11
#define TRNG_RTSCR6PL_RUN6P_MAX(x)               (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR6PL_RUN6P_MAX_SHIFT))&TRNG_RTSCR6PL_RUN6P_MAX_MASK)
#define TRNG_RTSCR6PL_RUN6P_RNG_MASK             0x7FF0000u
#define TRNG_RTSCR6PL_RUN6P_RNG_SHIFT            16
#define TRNG_RTSCR6PL_RUN6P_RNG_WIDTH            11
#define TRNG_RTSCR6PL_RUN6P_RNG(x)               (((uint32_t)(((uint32_t)(x))<<TRNG_RTSCR6PL_RUN6P_RNG_SHIFT))&TRNG_RTSCR6PL_RUN6P_RNG_MASK)
/* RTSTATUS Bit Fields */
#define TRNG_RTSTATUS_TF1BR0_MASK                0x1u
#define TRNG_RTSTATUS_TF1BR0_SHIFT               0
#define TRNG_RTSTATUS_TF1BR0_WIDTH               1
#define TRNG_RTSTATUS_TF1BR0(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF1BR0_SHIFT))&TRNG_RTSTATUS_TF1BR0_MASK)
#define TRNG_RTSTATUS_TF1BR1_MASK                0x2u
#define TRNG_RTSTATUS_TF1BR1_SHIFT               1
#define TRNG_RTSTATUS_TF1BR1_WIDTH               1
#define TRNG_RTSTATUS_TF1BR1(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF1BR1_SHIFT))&TRNG_RTSTATUS_TF1BR1_MASK)
#define TRNG_RTSTATUS_TF2BR0_MASK                0x4u
#define TRNG_RTSTATUS_TF2BR0_SHIFT               2
#define TRNG_RTSTATUS_TF2BR0_WIDTH               1
#define TRNG_RTSTATUS_TF2BR0(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF2BR0_SHIFT))&TRNG_RTSTATUS_TF2BR0_MASK)
#define TRNG_RTSTATUS_TF2BR1_MASK                0x8u
#define TRNG_RTSTATUS_TF2BR1_SHIFT               3
#define TRNG_RTSTATUS_TF2BR1_WIDTH               1
#define TRNG_RTSTATUS_TF2BR1(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF2BR1_SHIFT))&TRNG_RTSTATUS_TF2BR1_MASK)
#define TRNG_RTSTATUS_TF3BR0_MASK                0x10u
#define TRNG_RTSTATUS_TF3BR0_SHIFT               4
#define TRNG_RTSTATUS_TF3BR0_WIDTH               1
#define TRNG_RTSTATUS_TF3BR0(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF3BR0_SHIFT))&TRNG_RTSTATUS_TF3BR0_MASK)
#define TRNG_RTSTATUS_TF3BR1_MASK                0x20u
#define TRNG_RTSTATUS_TF3BR1_SHIFT               5
#define TRNG_RTSTATUS_TF3BR1_WIDTH               1
#define TRNG_RTSTATUS_TF3BR1(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF3BR1_SHIFT))&TRNG_RTSTATUS_TF3BR1_MASK)
#define TRNG_RTSTATUS_TF4BR0_MASK                0x40u
#define TRNG_RTSTATUS_TF4BR0_SHIFT               6
#define TRNG_RTSTATUS_TF4BR0_WIDTH               1
#define TRNG_RTSTATUS_TF4BR0(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF4BR0_SHIFT))&TRNG_RTSTATUS_TF4BR0_MASK)
#define TRNG_RTSTATUS_TF4BR1_MASK                0x80u
#define TRNG_RTSTATUS_TF4BR1_SHIFT               7
#define TRNG_RTSTATUS_TF4BR1_WIDTH               1
#define TRNG_RTSTATUS_TF4BR1(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF4BR1_SHIFT))&TRNG_RTSTATUS_TF4BR1_MASK)
#define TRNG_RTSTATUS_TF5BR0_MASK                0x100u
#define TRNG_RTSTATUS_TF5BR0_SHIFT               8
#define TRNG_RTSTATUS_TF5BR0_WIDTH               1
#define TRNG_RTSTATUS_TF5BR0(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF5BR0_SHIFT))&TRNG_RTSTATUS_TF5BR0_MASK)
#define TRNG_RTSTATUS_TF5BR1_MASK                0x200u
#define TRNG_RTSTATUS_TF5BR1_SHIFT               9
#define TRNG_RTSTATUS_TF5BR1_WIDTH               1
#define TRNG_RTSTATUS_TF5BR1(x)                  (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF5BR1_SHIFT))&TRNG_RTSTATUS_TF5BR1_MASK)
#define TRNG_RTSTATUS_TF6PBR0_MASK               0x400u
#define TRNG_RTSTATUS_TF6PBR0_SHIFT              10
#define TRNG_RTSTATUS_TF6PBR0_WIDTH              1
#define TRNG_RTSTATUS_TF6PBR0(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF6PBR0_SHIFT))&TRNG_RTSTATUS_TF6PBR0_MASK)
#define TRNG_RTSTATUS_TF6PBR1_MASK               0x800u
#define TRNG_RTSTATUS_TF6PBR1_SHIFT              11
#define TRNG_RTSTATUS_TF6PBR1_WIDTH              1
#define TRNG_RTSTATUS_TF6PBR1(x)                 (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TF6PBR1_SHIFT))&TRNG_RTSTATUS_TF6PBR1_MASK)
#define TRNG_RTSTATUS_TFSB_MASK                  0x1000u
#define TRNG_RTSTATUS_TFSB_SHIFT                 12
#define TRNG_RTSTATUS_TFSB_WIDTH                 1
#define TRNG_RTSTATUS_TFSB(x)                    (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TFSB_SHIFT))&TRNG_RTSTATUS_TFSB_MASK)
#define TRNG_RTSTATUS_TFLR_MASK                  0x2000u
#define TRNG_RTSTATUS_TFLR_SHIFT                 13
#define TRNG_RTSTATUS_TFLR_WIDTH                 1
#define TRNG_RTSTATUS_TFLR(x)                    (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TFLR_SHIFT))&TRNG_RTSTATUS_TFLR_MASK)
#define TRNG_RTSTATUS_TFP_MASK                   0x4000u
#define TRNG_RTSTATUS_TFP_SHIFT                  14
#define TRNG_RTSTATUS_TFP_WIDTH                  1
#define TRNG_RTSTATUS_TFP(x)                     (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TFP_SHIFT))&TRNG_RTSTATUS_TFP_MASK)
#define TRNG_RTSTATUS_TFMB_MASK                  0x8000u
#define TRNG_RTSTATUS_TFMB_SHIFT                 15
#define TRNG_RTSTATUS_TFMB_WIDTH                 1
#define TRNG_RTSTATUS_TFMB(x)                    (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_TFMB_SHIFT))&TRNG_RTSTATUS_TFMB_MASK)
#define TRNG_RTSTATUS_RETRY_CT_MASK              0xF0000u
#define TRNG_RTSTATUS_RETRY_CT_SHIFT             16
#define TRNG_RTSTATUS_RETRY_CT_WIDTH             4
#define TRNG_RTSTATUS_RETRY_CT(x)                (((uint32_t)(((uint32_t)(x))<<TRNG_RTSTATUS_RETRY_CT_SHIFT))&TRNG_RTSTATUS_RETRY_CT_MASK)
/* RTENT0 Bit Fields */
#define TRNG_RTENT0_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT0_ENT_SHIFT                    0
#define TRNG_RTENT0_ENT_WIDTH                    32
#define TRNG_RTENT0_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT0_ENT_SHIFT))&TRNG_RTENT0_ENT_MASK)
/* RTENT1 Bit Fields */
#define TRNG_RTENT1_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT1_ENT_SHIFT                    0
#define TRNG_RTENT1_ENT_WIDTH                    32
#define TRNG_RTENT1_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT1_ENT_SHIFT))&TRNG_RTENT1_ENT_MASK)
/* RTENT2 Bit Fields */
#define TRNG_RTENT2_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT2_ENT_SHIFT                    0
#define TRNG_RTENT2_ENT_WIDTH                    32
#define TRNG_RTENT2_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT2_ENT_SHIFT))&TRNG_RTENT2_ENT_MASK)
/* RTENT3 Bit Fields */
#define TRNG_RTENT3_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT3_ENT_SHIFT                    0
#define TRNG_RTENT3_ENT_WIDTH                    32
#define TRNG_RTENT3_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT3_ENT_SHIFT))&TRNG_RTENT3_ENT_MASK)
/* RTENT4 Bit Fields */
#define TRNG_RTENT4_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT4_ENT_SHIFT                    0
#define TRNG_RTENT4_ENT_WIDTH                    32
#define TRNG_RTENT4_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT4_ENT_SHIFT))&TRNG_RTENT4_ENT_MASK)
/* RTENT5 Bit Fields */
#define TRNG_RTENT5_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT5_ENT_SHIFT                    0
#define TRNG_RTENT5_ENT_WIDTH                    32
#define TRNG_RTENT5_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT5_ENT_SHIFT))&TRNG_RTENT5_ENT_MASK)
/* RTENT6 Bit Fields */
#define TRNG_RTENT6_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT6_ENT_SHIFT                    0
#define TRNG_RTENT6_ENT_WIDTH                    32
#define TRNG_RTENT6_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT6_ENT_SHIFT))&TRNG_RTENT6_ENT_MASK)
/* RTENT7 Bit Fields */
#define TRNG_RTENT7_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT7_ENT_SHIFT                    0
#define TRNG_RTENT7_ENT_WIDTH                    32
#define TRNG_RTENT7_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT7_ENT_SHIFT))&TRNG_RTENT7_ENT_MASK)
/* RTENT8 Bit Fields */
#define TRNG_RTENT8_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT8_ENT_SHIFT                    0
#define TRNG_RTENT8_ENT_WIDTH                    32
#define TRNG_RTENT8_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT8_ENT_SHIFT))&TRNG_RTENT8_ENT_MASK)
/* RTENT9 Bit Fields */
#define TRNG_RTENT9_ENT_MASK                     0xFFFFFFFFu
#define TRNG_RTENT9_ENT_SHIFT                    0
