pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22.h
#define TRNG_RTENT9_ENT_WIDTH                    32
#define TRNG_RTENT9_ENT(x)                       (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT9_ENT_SHIFT))&TRNG_RTENT9_ENT_MASK)
/* RTENT10 Bit Fields */
#define TRNG_RTENT10_ENT_MASK                    0xFFFFFFFFu
#define TRNG_RTENT10_ENT_SHIFT                   0
#define TRNG_RTENT10_ENT_WIDTH                   32
#define TRNG_RTENT10_ENT(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT10_ENT_SHIFT))&TRNG_RTENT10_ENT_MASK)
/* RTENT11 Bit Fields */
#define TRNG_RTENT11_ENT_MASK                    0xFFFFFFFFu
#define TRNG_RTENT11_ENT_SHIFT                   0
#define TRNG_RTENT11_ENT_WIDTH                   32
#define TRNG_RTENT11_ENT(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT11_ENT_SHIFT))&TRNG_RTENT11_ENT_MASK)
/* RTENT12 Bit Fields */
#define TRNG_RTENT12_ENT_MASK                    0xFFFFFFFFu
#define TRNG_RTENT12_ENT_SHIFT                   0
#define TRNG_RTENT12_ENT_WIDTH                   32
#define TRNG_RTENT12_ENT(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT12_ENT_SHIFT))&TRNG_RTENT12_ENT_MASK)
/* RTENT13 Bit Fields */
#define TRNG_RTENT13_ENT_MASK                    0xFFFFFFFFu
#define TRNG_RTENT13_ENT_SHIFT                   0
#define TRNG_RTENT13_ENT_WIDTH                   32
#define TRNG_RTENT13_ENT(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT13_ENT_SHIFT))&TRNG_RTENT13_ENT_MASK)
/* RTENT14 Bit Fields */
#define TRNG_RTENT14_ENT_MASK                    0xFFFFFFFFu
#define TRNG_RTENT14_ENT_SHIFT                   0
#define TRNG_RTENT14_ENT_WIDTH                   32
#define TRNG_RTENT14_ENT(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT14_ENT_SHIFT))&TRNG_RTENT14_ENT_MASK)
/* RTENT15 Bit Fields */
#define TRNG_RTENT15_ENT_MASK                    0xFFFFFFFFu
#define TRNG_RTENT15_ENT_SHIFT                   0
#define TRNG_RTENT15_ENT_WIDTH                   32
#define TRNG_RTENT15_ENT(x)                      (((uint32_t)(((uint32_t)(x))<<TRNG_RTENT15_ENT_SHIFT))&TRNG_RTENT15_ENT_MASK)
/* RTPKRCNT10 Bit Fields */
#define TRNG_RTPKRCNT10_PKR_0_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNT10_PKR_0_CT_SHIFT           0
#define TRNG_RTPKRCNT10_PKR_0_CT_WIDTH           16
#define TRNG_RTPKRCNT10_PKR_0_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT10_PKR_0_CT_SHIFT))&TRNG_RTPKRCNT10_PKR_0_CT_MASK)
#define TRNG_RTPKRCNT10_PKR_1_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNT10_PKR_1_CT_SHIFT           16
#define TRNG_RTPKRCNT10_PKR_1_CT_WIDTH           16
#define TRNG_RTPKRCNT10_PKR_1_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT10_PKR_1_CT_SHIFT))&TRNG_RTPKRCNT10_PKR_1_CT_MASK)
/* RTPKRCNT32 Bit Fields */
#define TRNG_RTPKRCNT32_PKR_2_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNT32_PKR_2_CT_SHIFT           0
#define TRNG_RTPKRCNT32_PKR_2_CT_WIDTH           16
#define TRNG_RTPKRCNT32_PKR_2_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT32_PKR_2_CT_SHIFT))&TRNG_RTPKRCNT32_PKR_2_CT_MASK)
#define TRNG_RTPKRCNT32_PKR_3_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNT32_PKR_3_CT_SHIFT           16
#define TRNG_RTPKRCNT32_PKR_3_CT_WIDTH           16
#define TRNG_RTPKRCNT32_PKR_3_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT32_PKR_3_CT_SHIFT))&TRNG_RTPKRCNT32_PKR_3_CT_MASK)
/* RTPKRCNT54 Bit Fields */
#define TRNG_RTPKRCNT54_PKR_4_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNT54_PKR_4_CT_SHIFT           0
#define TRNG_RTPKRCNT54_PKR_4_CT_WIDTH           16
#define TRNG_RTPKRCNT54_PKR_4_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT54_PKR_4_CT_SHIFT))&TRNG_RTPKRCNT54_PKR_4_CT_MASK)
#define TRNG_RTPKRCNT54_PKR_5_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNT54_PKR_5_CT_SHIFT           16
#define TRNG_RTPKRCNT54_PKR_5_CT_WIDTH           16
#define TRNG_RTPKRCNT54_PKR_5_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT54_PKR_5_CT_SHIFT))&TRNG_RTPKRCNT54_PKR_5_CT_MASK)
/* RTPKRCNT76 Bit Fields */
#define TRNG_RTPKRCNT76_PKR_6_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNT76_PKR_6_CT_SHIFT           0
#define TRNG_RTPKRCNT76_PKR_6_CT_WIDTH           16
#define TRNG_RTPKRCNT76_PKR_6_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT76_PKR_6_CT_SHIFT))&TRNG_RTPKRCNT76_PKR_6_CT_MASK)
#define TRNG_RTPKRCNT76_PKR_7_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNT76_PKR_7_CT_SHIFT           16
#define TRNG_RTPKRCNT76_PKR_7_CT_WIDTH           16
#define TRNG_RTPKRCNT76_PKR_7_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT76_PKR_7_CT_SHIFT))&TRNG_RTPKRCNT76_PKR_7_CT_MASK)
/* RTPKRCNT98 Bit Fields */
#define TRNG_RTPKRCNT98_PKR_8_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNT98_PKR_8_CT_SHIFT           0
#define TRNG_RTPKRCNT98_PKR_8_CT_WIDTH           16
#define TRNG_RTPKRCNT98_PKR_8_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT98_PKR_8_CT_SHIFT))&TRNG_RTPKRCNT98_PKR_8_CT_MASK)
#define TRNG_RTPKRCNT98_PKR_9_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNT98_PKR_9_CT_SHIFT           16
#define TRNG_RTPKRCNT98_PKR_9_CT_WIDTH           16
#define TRNG_RTPKRCNT98_PKR_9_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNT98_PKR_9_CT_SHIFT))&TRNG_RTPKRCNT98_PKR_9_CT_MASK)
/* RTPKRCNTBA Bit Fields */
#define TRNG_RTPKRCNTBA_PKR_A_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNTBA_PKR_A_CT_SHIFT           0
#define TRNG_RTPKRCNTBA_PKR_A_CT_WIDTH           16
#define TRNG_RTPKRCNTBA_PKR_A_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNTBA_PKR_A_CT_SHIFT))&TRNG_RTPKRCNTBA_PKR_A_CT_MASK)
#define TRNG_RTPKRCNTBA_PKR_B_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNTBA_PKR_B_CT_SHIFT           16
#define TRNG_RTPKRCNTBA_PKR_B_CT_WIDTH           16
#define TRNG_RTPKRCNTBA_PKR_B_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNTBA_PKR_B_CT_SHIFT))&TRNG_RTPKRCNTBA_PKR_B_CT_MASK)
/* RTPKRCNTDC Bit Fields */
#define TRNG_RTPKRCNTDC_PKR_C_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNTDC_PKR_C_CT_SHIFT           0
#define TRNG_RTPKRCNTDC_PKR_C_CT_WIDTH           16
#define TRNG_RTPKRCNTDC_PKR_C_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNTDC_PKR_C_CT_SHIFT))&TRNG_RTPKRCNTDC_PKR_C_CT_MASK)
#define TRNG_RTPKRCNTDC_PKR_D_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNTDC_PKR_D_CT_SHIFT           16
#define TRNG_RTPKRCNTDC_PKR_D_CT_WIDTH           16
#define TRNG_RTPKRCNTDC_PKR_D_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNTDC_PKR_D_CT_SHIFT))&TRNG_RTPKRCNTDC_PKR_D_CT_MASK)
/* RTPKRCNTFE Bit Fields */
#define TRNG_RTPKRCNTFE_PKR_E_CT_MASK            0xFFFFu
#define TRNG_RTPKRCNTFE_PKR_E_CT_SHIFT           0
#define TRNG_RTPKRCNTFE_PKR_E_CT_WIDTH           16
#define TRNG_RTPKRCNTFE_PKR_E_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNTFE_PKR_E_CT_SHIFT))&TRNG_RTPKRCNTFE_PKR_E_CT_MASK)
#define TRNG_RTPKRCNTFE_PKR_F_CT_MASK            0xFFFF0000u
#define TRNG_RTPKRCNTFE_PKR_F_CT_SHIFT           16
#define TRNG_RTPKRCNTFE_PKR_F_CT_WIDTH           16
#define TRNG_RTPKRCNTFE_PKR_F_CT(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_RTPKRCNTFE_PKR_F_CT_SHIFT))&TRNG_RTPKRCNTFE_PKR_F_CT_MASK)
/* SA_TRNG_SEC_CFG Bit Fields */
#define TRNG_SA_TRNG_SEC_CFG_SH0_MASK            0x1u
#define TRNG_SA_TRNG_SEC_CFG_SH0_SHIFT           0
#define TRNG_SA_TRNG_SEC_CFG_SH0_WIDTH           1
#define TRNG_SA_TRNG_SEC_CFG_SH0(x)              (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_SEC_CFG_SH0_SHIFT))&TRNG_SA_TRNG_SEC_CFG_SH0_MASK)
#define TRNG_SA_TRNG_SEC_CFG_NO_PRGM_MASK        0x2u
#define TRNG_SA_TRNG_SEC_CFG_NO_PRGM_SHIFT       1
#define TRNG_SA_TRNG_SEC_CFG_NO_PRGM_WIDTH       1
#define TRNG_SA_TRNG_SEC_CFG_NO_PRGM(x)          (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_SEC_CFG_NO_PRGM_SHIFT))&TRNG_SA_TRNG_SEC_CFG_NO_PRGM_MASK)
#define TRNG_SA_TRNG_SEC_CFG_SK_VAL_MASK         0x4u
#define TRNG_SA_TRNG_SEC_CFG_SK_VAL_SHIFT        2
#define TRNG_SA_TRNG_SEC_CFG_SK_VAL_WIDTH        1
#define TRNG_SA_TRNG_SEC_CFG_SK_VAL(x)           (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_SEC_CFG_SK_VAL_SHIFT))&TRNG_SA_TRNG_SEC_CFG_SK_VAL_MASK)
/* SA_TRNG_INT_CTRL Bit Fields */
#define TRNG_SA_TRNG_INT_CTRL_HW_ERR_MASK        0x1u
#define TRNG_SA_TRNG_INT_CTRL_HW_ERR_SHIFT       0
#define TRNG_SA_TRNG_INT_CTRL_HW_ERR_WIDTH       1
#define TRNG_SA_TRNG_INT_CTRL_HW_ERR(x)          (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_CTRL_HW_ERR_SHIFT))&TRNG_SA_TRNG_INT_CTRL_HW_ERR_MASK)
#define TRNG_SA_TRNG_INT_CTRL_ENT_VAL_MASK       0x2u
#define TRNG_SA_TRNG_INT_CTRL_ENT_VAL_SHIFT      1
#define TRNG_SA_TRNG_INT_CTRL_ENT_VAL_WIDTH      1
#define TRNG_SA_TRNG_INT_CTRL_ENT_VAL(x)         (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_CTRL_ENT_VAL_SHIFT))&TRNG_SA_TRNG_INT_CTRL_ENT_VAL_MASK)
#define TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_MASK   0x4u
#define TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT  2
#define TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_WIDTH  1
#define TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL(x)     (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT))&TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_MASK)
#define TRNG_SA_TRNG_INT_CTRL_UNUSED_MASK        0xFFFFFFF8u
#define TRNG_SA_TRNG_INT_CTRL_UNUSED_SHIFT       3
#define TRNG_SA_TRNG_INT_CTRL_UNUSED_WIDTH       29
#define TRNG_SA_TRNG_INT_CTRL_UNUSED(x)          (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_CTRL_UNUSED_SHIFT))&TRNG_SA_TRNG_INT_CTRL_UNUSED_MASK)
/* SA_TRNG_INT_MASK Bit Fields */
#define TRNG_SA_TRNG_INT_MASK_HW_ERR_MASK        0x1u
#define TRNG_SA_TRNG_INT_MASK_HW_ERR_SHIFT       0
#define TRNG_SA_TRNG_INT_MASK_HW_ERR_WIDTH       1
#define TRNG_SA_TRNG_INT_MASK_HW_ERR(x)          (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_MASK_HW_ERR_SHIFT))&TRNG_SA_TRNG_INT_MASK_HW_ERR_MASK)
#define TRNG_SA_TRNG_INT_MASK_ENT_VAL_MASK       0x2u
#define TRNG_SA_TRNG_INT_MASK_ENT_VAL_SHIFT      1
#define TRNG_SA_TRNG_INT_MASK_ENT_VAL_WIDTH      1
#define TRNG_SA_TRNG_INT_MASK_ENT_VAL(x)         (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_MASK_ENT_VAL_SHIFT))&TRNG_SA_TRNG_INT_MASK_ENT_VAL_MASK)
#define TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_MASK   0x4u
#define TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT  2
#define TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_WIDTH  1
#define TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL(x)     (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT))&TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_MASK)
/* SA_TRNG_INT_STATUS Bit Fields */
#define TRNG_SA_TRNG_INT_STATUS_HW_ERR_MASK      0x1u
#define TRNG_SA_TRNG_INT_STATUS_HW_ERR_SHIFT     0
#define TRNG_SA_TRNG_INT_STATUS_HW_ERR_WIDTH     1
#define TRNG_SA_TRNG_INT_STATUS_HW_ERR(x)        (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_STATUS_HW_ERR_SHIFT))&TRNG_SA_TRNG_INT_STATUS_HW_ERR_MASK)
#define TRNG_SA_TRNG_INT_STATUS_ENT_VAL_MASK     0x2u
#define TRNG_SA_TRNG_INT_STATUS_ENT_VAL_SHIFT    1
#define TRNG_SA_TRNG_INT_STATUS_ENT_VAL_WIDTH    1
#define TRNG_SA_TRNG_INT_STATUS_ENT_VAL(x)       (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_STATUS_ENT_VAL_SHIFT))&TRNG_SA_TRNG_INT_STATUS_ENT_VAL_MASK)
#define TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_MASK 0x4u
#define TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT 2
#define TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_WIDTH 1
#define TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL(x)   (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT))&TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_MASK)
/* SA_TRNG_VID1 Bit Fields */
#define TRNG_SA_TRNG_VID1_RNG_MIN_REV_MASK       0xFFu
#define TRNG_SA_TRNG_VID1_RNG_MIN_REV_SHIFT      0
#define TRNG_SA_TRNG_VID1_RNG_MIN_REV_WIDTH      8
#define TRNG_SA_TRNG_VID1_RNG_MIN_REV(x)         (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID1_RNG_MIN_REV_SHIFT))&TRNG_SA_TRNG_VID1_RNG_MIN_REV_MASK)
#define TRNG_SA_TRNG_VID1_RNG_MAJ_REV_MASK       0xFF00u
#define TRNG_SA_TRNG_VID1_RNG_MAJ_REV_SHIFT      8
#define TRNG_SA_TRNG_VID1_RNG_MAJ_REV_WIDTH      8
#define TRNG_SA_TRNG_VID1_RNG_MAJ_REV(x)         (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID1_RNG_MAJ_REV_SHIFT))&TRNG_SA_TRNG_VID1_RNG_MAJ_REV_MASK)
#define TRNG_SA_TRNG_VID1_RNG_IP_ID_MASK         0xFFFF0000u
#define TRNG_SA_TRNG_VID1_RNG_IP_ID_SHIFT        16
#define TRNG_SA_TRNG_VID1_RNG_IP_ID_WIDTH        16
#define TRNG_SA_TRNG_VID1_RNG_IP_ID(x)           (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID1_RNG_IP_ID_SHIFT))&TRNG_SA_TRNG_VID1_RNG_IP_ID_MASK)
/* SA_TRNG_VID2 Bit Fields */
#define TRNG_SA_TRNG_VID2_RNG_CONFIG_OPT_MASK    0xFFu
#define TRNG_SA_TRNG_VID2_RNG_CONFIG_OPT_SHIFT   0
#define TRNG_SA_TRNG_VID2_RNG_CONFIG_OPT_WIDTH   8
#define TRNG_SA_TRNG_VID2_RNG_CONFIG_OPT(x)      (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID2_RNG_CONFIG_OPT_SHIFT))&TRNG_SA_TRNG_VID2_RNG_CONFIG_OPT_MASK)
#define TRNG_SA_TRNG_VID2_RNG_ECO_REV_MASK       0xFF00u
#define TRNG_SA_TRNG_VID2_RNG_ECO_REV_SHIFT      8
#define TRNG_SA_TRNG_VID2_RNG_ECO_REV_WIDTH      8
#define TRNG_SA_TRNG_VID2_RNG_ECO_REV(x)         (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID2_RNG_ECO_REV_SHIFT))&TRNG_SA_TRNG_VID2_RNG_ECO_REV_MASK)
#define TRNG_SA_TRNG_VID2_RNG_INTG_OPT_MASK      0xFF0000u
#define TRNG_SA_TRNG_VID2_RNG_INTG_OPT_SHIFT     16
#define TRNG_SA_TRNG_VID2_RNG_INTG_OPT_WIDTH     8
#define TRNG_SA_TRNG_VID2_RNG_INTG_OPT(x)        (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID2_RNG_INTG_OPT_SHIFT))&TRNG_SA_TRNG_VID2_RNG_INTG_OPT_MASK)
#define TRNG_SA_TRNG_VID2_RNG_ERA_MASK           0xFF000000u
#define TRNG_SA_TRNG_VID2_RNG_ERA_SHIFT          24
#define TRNG_SA_TRNG_VID2_RNG_ERA_WIDTH          8
#define TRNG_SA_TRNG_VID2_RNG_ERA(x)             (((uint32_t)(((uint32_t)(x))<<TRNG_SA_TRNG_VID2_RNG_ERA_SHIFT))&TRNG_SA_TRNG_VID2_RNG_ERA_MASK)

/*!
 * @}
 */ /* end of group TRNG_Register_Masks */


/* TRNG - Peripheral instance base addresses */
/** Peripheral TRNG base address */
#define TRNG_BASE                                (0x400A0000u)
/** Peripheral TRNG base pointer */
#define TRNG                                     ((TRNG_Type *)TRNG_BASE)
#define TRNG_BASE_PTR                            (TRNG)
/** Array initializer of TRNG peripheral base addresses */
#define TRNG_BASE_ADDRS                          { TRNG_BASE }
/** Array initializer of TRNG peripheral base pointers */
#define TRNG_BASE_PTRS                           { TRNG }

/* ----------------------------------------------------------------------------
   -- TRNG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRNG_Register_Accessor_Macros TRNG - Register accessor macros
 * @{
 */


/* TRNG - Register instance definitions */
/* TRNG */
#define TRNG_RTMCTL                              TRNG_RTMCTL_REG(TRNG)
#define TRNG_RTSCMISC                            TRNG_RTSCMISC_REG(TRNG)
#define TRNG_RTPKRRNG                            TRNG_RTPKRRNG_REG(TRNG)
#define TRNG_RTPKRMAX                            TRNG_RTPKRMAX_REG(TRNG)
#define TRNG_RTPKRSQ                             TRNG_RTPKRSQ_REG(TRNG)
#define TRNG_RTSDCTL                             TRNG_RTSDCTL_REG(TRNG)
#define TRNG_RTSBLIM                             TRNG_RTSBLIM_REG(TRNG)
#define TRNG_RTTOTSAM                            TRNG_RTTOTSAM_REG(TRNG)
#define TRNG_RTFRQMIN                            TRNG_RTFRQMIN_REG(TRNG)
#define TRNG_RTFRQCNT                            TRNG_RTFRQCNT_REG(TRNG)
#define TRNG_RTFRQMAX                            TRNG_RTFRQMAX_REG(TRNG)
#define TRNG_RTSCMC                              TRNG_RTSCMC_REG(TRNG)
#define TRNG_RTSCML                              TRNG_RTSCML_REG(TRNG)
#define TRNG_RTSCR1C                             TRNG_RTSCR1C_REG(TRNG)
#define TRNG_RTSCR1L                             TRNG_RTSCR1L_REG(TRNG)
#define TRNG_RTSCR2C                             TRNG_RTSCR2C_REG(TRNG)
#define TRNG_RTSCR2L                             TRNG_RTSCR2L_REG(TRNG)
#define TRNG_RTSCR3C                             TRNG_RTSCR3C_REG(TRNG)
#define TRNG_RTSCR3L                             TRNG_RTSCR3L_REG(TRNG)
#define TRNG_RTSCR4C                             TRNG_RTSCR4C_REG(TRNG)
#define TRNG_RTSCR4L                             TRNG_RTSCR4L_REG(TRNG)
#define TRNG_RTSCR5C                             TRNG_RTSCR5C_REG(TRNG)
#define TRNG_RTSCR5L                             TRNG_RTSCR5L_REG(TRNG)
#define TRNG_RTSCR6PC                            TRNG_RTSCR6PC_REG(TRNG)
#define TRNG_RTSCR6PL                            TRNG_RTSCR6PL_REG(TRNG)
#define TRNG_RTSTATUS                            TRNG_RTSTATUS_REG(TRNG)
#define TRNG_RTENT0                              TRNG_RTENT0_REG(TRNG)
#define TRNG_RTENT1                              TRNG_RTENT1_REG(TRNG)
#define TRNG_RTENT2                              TRNG_RTENT2_REG(TRNG)
#define TRNG_RTENT3                              TRNG_RTENT3_REG(TRNG)
#define TRNG_RTENT4                              TRNG_RTENT4_REG(TRNG)
#define TRNG_RTENT5                              TRNG_RTENT5_REG(TRNG)
#define TRNG_RTENT6                              TRNG_RTENT6_REG(TRNG)
#define TRNG_RTENT7                              TRNG_RTENT7_REG(TRNG)
#define TRNG_RTENT8                              TRNG_RTENT8_REG(TRNG)
#define TRNG_RTENT9                              TRNG_RTENT9_REG(TRNG)
#define TRNG_RTENT10                             TRNG_RTENT10_REG(TRNG)
#define TRNG_RTENT11                             TRNG_RTENT11_REG(TRNG)
#define TRNG_RTENT12                             TRNG_RTENT12_REG(TRNG)
#define TRNG_RTENT13                             TRNG_RTENT13_REG(TRNG)
#define TRNG_RTENT14                             TRNG_RTENT14_REG(TRNG)
#define TRNG_RTENT15                             TRNG_RTENT15_REG(TRNG)
#define TRNG_RTPKRCNT10                          TRNG_RTPKRCNT10_REG(TRNG)
#define TRNG_RTPKRCNT32                          TRNG_RTPKRCNT32_REG(TRNG)
#define TRNG_RTPKRCNT54                          TRNG_RTPKRCNT54_REG(TRNG)
#define TRNG_RTPKRCNT76                          TRNG_RTPKRCNT76_REG(TRNG)
#define TRNG_RTPKRCNT98                          TRNG_RTPKRCNT98_REG(TRNG)
#define TRNG_RTPKRCNTBA                          TRNG_RTPKRCNTBA_REG(TRNG)
#define TRNG_RTPKRCNTDC                          TRNG_RTPKRCNTDC_REG(TRNG)
#define TRNG_RTPKRCNTFE                          TRNG_RTPKRCNTFE_REG(TRNG)
#define TRNG_SA_TRNG_SEC_CFG                     TRNG_SA_TRNG_SEC_CFG_REG(TRNG)
#define TRNG_SA_TRNG_INT_CTRL                    TRNG_SA_TRNG_INT_CTRL_REG(TRNG)
#define TRNG_SA_TRNG_INT_MASK                    TRNG_SA_TRNG_INT_MASK_REG(TRNG)
#define TRNG_SA_TRNG_INT_STATUS                  TRNG_SA_TRNG_INT_STATUS_REG(TRNG)
#define TRNG_SA_TRNG_VID1                        TRNG_SA_TRNG_VID1_REG(TRNG)
#define TRNG_SA_TRNG_VID2                        TRNG_SA_TRNG_VID2_REG(TRNG)

/*!
 * @}
 */ /* end of group TRNG_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group TRNG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- UART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UART_Peripheral_Access_Layer UART Peripheral Access Layer
 * @{
 */

